cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>LPC15xx</name>
	<version>0.7</version>
	<description>LPC15xx Cortex-M3 MCU; up to 64 kB flash; up to 12 kB SRAM; USB device; USART; EEPROM</description>
	<cpu>
		<name>CM3</name>
		<revision>r2p1</revision>
		<endian>little</endian>
		<mpuPresent>0</mpuPresent>
		<fpuPresent>0</fpuPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu>
	<headerDefinitionsPrefix>LPC_</headerDefinitionsPrefix>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>
	<!--
		Software that is described herein is for illustrative purposes only
		which provides customers with programming information regarding the
		products. This software is supplied "AS IS" without any warranties.
		NXP Semiconductors assumes no responsibility or liability for the
		use of the software, conveys no license or title under any patent,
		copyright, or mask work right to the product. NXP Semiconductors
		reserves the right to make changes in the software without
		notification. NXP Semiconductors also make no representation or
		warranty that such application will be suitable for the specified
		use without further testing or modification.
	-->
<!--
	v0.3 changes
	PINMUX changed to INPUT MUX; register names changed to INMUX
	part name canged to LPC15xx
	v0.4 changes
	CAN prefix removed from CAN registers
	iocon updated with glitch filter registers
	v0.5 changes
	USART register map updated with minUSART v2  IP version
	v0.6 changes
	C_CAN register map corrected - IF2_DAx and IF2_DBx registers added
	-->
	<peripherals>
		<peripheral>
	<name>GPIO_PORT</name>
	<description>General Purpose I/O (GPIO) </description>
	<groupName>GPIO</groupName>
	<baseAddress>0x1C000000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x40000</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
		<register>
			<dim>76</dim>
			<dimIncrement>0x1</dimIncrement>
			<dimIndex>0-75</dimIndex>
			<name>B[%s]</name>
			<displayName>B[%s]</displayName>
			<description>Byte pin registers</description>
			<addressOffset>0x0000</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PBYTE</name>
					<description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>76</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-75</dimIndex>
			<name>W[%s]</name>
			<displayName>W[%s]</displayName>
			<description>Word pin registers </description>
			<addressOffset>0x1000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PWORD</name>
					<description>Read 0: pin PIOm_n is LOW.  Write 0: clear output bit. Read 0xFFFF FFFF: pin PIOm_n is HIGH.  Write any value 0x0000 0001 to 0xFFFF FFFF: set output bit. Only 0 or 0xFFFF FFFF can be read. Writing any value other than 0 will set the output bit. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-2</dimIndex>
			<name>DIR[%s]</name>
			<displayName>DIR[%s]</displayName>
			<description>Port Direction registers </description>
			<addressOffset>0x2000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIRP0</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>DIRP1</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>DIRP2</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DIRP3</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>DIRP4</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>DIRP5</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>DIRP6</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>DIRP7</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>DIRP8</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>DIRP9</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>DIRP10</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>DIRP11</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>DIRP12</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>DIRP13</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>DIRP14</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>DIRP15</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>DIRP16</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>DIRP17</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>DIRP18</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>DIRP19</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>DIRP20</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>DIRP21</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>DIRP22</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>DIRP23</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>DIRP24</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>DIRP25</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>DIRP26</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>DIRP27</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>DIRP28</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>DIRP29</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>DIRP30</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>DIRP31</name>
					<description>Selects pin direction for pin PIOm_n (bit 0 = PIOm_0, bit 1 = PIOm_1, ..., bit 31 = PIOm_31). m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port2. 0 = input. 1 = output.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
