cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>ERRINT0</name>
			<description>Error Interrupt status for all DMA channels.</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ERR0</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ERR1</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ERR2</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ERR3</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ERR4</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ERR5</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ERR6</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ERR7</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ERR8</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR9</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ERR10</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ERR11</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>ERR12</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>ERR13</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>ERR14</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>ERR15</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>ERR16</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>ERR17</name>
					<description>Error Interrupt flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = error interrupt is not active. 1 = error interrupt is active.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTENSET0</name>
			<description>Interrupt Enable read and Set for all DMA channels.</description>
			<addressOffset>0x048</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SET0</name>
					<description>0</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SET1</name>
					<description>0</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SET2</name>
					<description>0</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SET3</name>
					<description>0</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SET4</name>
					<description>0</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SET5</name>
					<description>0</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SET6</name>
					<description>0</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SET7</name>
					<description>0</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SET8</name>
					<description>0</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SET9</name>
					<description>0</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SET10</name>
					<description>0</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SET11</name>
					<description>0</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SET12</name>
					<description>0</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>SET13</name>
					<description>0</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>SET14</name>
					<description>0</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>SET15</name>
					<description>0</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>SET16</name>
					<description>0</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>SET17</name>
					<description>0</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTENCLR0</name>
			<description>Interrupt Enable Clear for all DMA channels.</description>
			<addressOffset>0x050</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CLR0</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CLR1</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CLR2</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLR3</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CLR4</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CLR5</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CLR6</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CLR7</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CLR8</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CLR9</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CLR10</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CLR11</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CLR12</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CLR13</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CLR14</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CLR15</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>CLR16</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>CLR17</name>
					<description>Writing ones to this register clears corresponding bits in the INTENSET0. Bit n corresponds to DMA channel n.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTA0</name>
			<description>Interrupt A status for all DMA channels.</description>
			<addressOffset>0x058</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IA0</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>IA1</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>IA2</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>IA3</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>IA4</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>IA5</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>IA6</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>IA7</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>IA8</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>IA9</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>IA10</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>IA11</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>IA12</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>IA13</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>IA14</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>IA15</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>IA16</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>IA17</name>
					<description>Interrupt A status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt A is not active. 1 = the DMA channel interrupt A is active.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTB0</name>
			<description>Interrupt B status for all DMA channels.</description>
			<addressOffset>0x060</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IB0</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>IB1</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>IB2</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>IB3</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>IB4</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>IB5</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>IB6</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>IB7</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>IB8</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>IB9</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>IB10</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>IB11</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>IB12</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>IB13</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>IB14</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>IB15</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>IB16</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>IB17</name>
					<description>Interrupt B status for DMA channel n. Bit n corresponds to DMA channel n. 0 = the DMA channel interrupt B is not active. 1 = the DMA channel interrupt B is active.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
