cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
	</registers>
		</peripheral>
		<peripheral>
			<name>CRC</name>
			<description>Cyclic Redundancy Check (CRC) engine</description>
			<groupName>CRC</groupName>
			<baseAddress>0x1C010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MODE</name>
					<description>CRC mode register</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_POLY</name>
							<description>CRC polynom: 1X= CRC-32 polynomial 01= CRC-16 polynomial 00= CRC-CCITT polynomial</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>BIT_RVS_WR</name>
							<description>Data bit order: 1= Bit order reverse for CRC_WR_DATA (per byte) 0= No bit order reverse for CRC_WR_DATA (per byte)</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CMPL_WR</name>
							<description>Data complement: 1= 1's complement for CRC_WR_DATA 0= No 1's complement for CRC_WR_DATA</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>BIT_RVS_SUM</name>
							<description>CRC sum bit order: 1= Bit order reverse for CRC_SUM 0= No bit order reverse for CRC_SUM</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CMPL_SUM</name>
							<description>CRC sum complement: 1= 1's complement for CRC_SUM 0=No 1's complement for CRC_SUM</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>Reserved</name>
							<description>Always 0 when read</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SEED</name>
					<description>CRC seed register</description>
					<addressOffset>0x04</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SEED</name>
							<description>A write access to this register will load CRC seed value to CRC_SUM register with selected bit order and 1's complement pre-processes. A write access to this register will overrule the CRC calculation in progresses.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SUM</name>
					<description>CRC checksum register</description>
					<addressOffset>0x08</addressOffset>
					<access>read-only</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SUM</name>
							<description>The most recent CRC sum can be read through this register with selected bit order and 1's complement post-processes.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WR_DATA</name>
					<description>CRC data register</description>
					<alternateRegister>SUM</alternateRegister>
					<addressOffset>0x08</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CRC_WR_DATA</name>
							<description>Data written to this register will be taken to perform CRC calculation with selected bit order and 1's complement pre-process. Any write size 8, 16 or 32-bit are allowed and accept back-to-back transactions.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
	<name>SCT0</name>
	<description>Large State Configurable Timers 0/1 (SCT0/1)</description>
	<groupName>SCT0</groupName>
	<baseAddress>0x1C018000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SCT0</name>
	<value>16</value>
	</interrupt>
	<registers>
		<register>
			<name>CONFIG</name>
			<description>SCT configuration register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x00007E00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>UNIFY</name>
					<description>SCT operation</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_SCT_OPERATES_AS</name>
							<description>The SCT operates as two 16-bit counters named L and H.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SCT_OPERATES_AS</name>
							<description>The SCT operates as a unified 32-bit counter.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKMODE</name>
					<description>SCT clock mode</description>
					<bitRange>[2:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SYSTEM_CLOCK</name>
							<description>System clock. The system clock clocks the SCT and prescalers.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PRESCALED_SYSTEM_CLO</name>
							<description>Prescaled system clock. The SCT clock is the system clock, but the prescalers are  enabled to count only when sampling of the input selected by  the CKSEL field finds the selected edge. The minimum pulse  width on the clock input is 1 bus clock period. This mode is the high-performance  sampled-clock mode.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_INPUT</name>
							<description>SCT input. The input selected by  CLKSEL clocks the SCT and prescalers. The input is synchronized to the bus clock and possibly inverted.  The minimum pulse width on the clock input is 1 bus clock  period. This mode is the low-power sampled-clock mode.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PRESCALED_SCT_INPUT</name>
							<description>Prescaled SCT input. The SCT and prescalers are clocked by the input edge  selected by the CLKSEL field. In this mode, most of the SCT is clocked by the (selected polarity of the)  input. The outputs are switched synchronously to the input clock. The input clock rate must be at least half the system clock rate and  can the same or faster than the system clock.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKSEL</name>
					<description>SCT clock select</description>
					<bitRange>[6:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 0.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 1.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 1.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 2.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 2.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 3.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 3.</description>
							<value>0x7</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 4.</description>
							<value>0x8</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 4.</description>
							<value>0x9</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 5.</description>
							<value>0xA</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 5.</description>
							<value>0xB</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 6.</description>
							<value>0xC</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 6.</description>
							<value>0xD</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 7.</description>
							<value>0xE</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 7.</description>
							<value>0xF</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NORELAOD_L</name>
					<description>A 1 in this bit prevents the lower match and fractional match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit applies to both the  higher and lower registers when the UNIFY bit is set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>NORELOAD_H</name>
					<description>A 1 in this bit prevents the higher match and fractional match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit is not used when  the UNIFY bit is set.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>INSYNC</name>
					<description>Synchronization for input n (bit 9 = input 0, bit 10 = input 1,..., bit 16 = input 7). A 1 in one of these bits subjects the corresponding input to  synchronization to the SCT clock, before it is used to create an  event. If an input is synchronous to the SCT clock, keep its bit 0 for  faster response. When the CKMODE field is 1x, the bit in this field, corresponding  to the input selected by the CKSEL field, is not used.</description>
					<bitRange>[16:9]</bitRange>
				</field>
				<field>
					<name>AUTOLIMIT_L</name>
					<description>A one in this bit causes a match on match register 0 to be treated  as a de-facto LIMIT condition without the need to define an  associated event. As with any LIMIT event, this automatic limit causes the  counter to be cleared to zero in uni-directional mode or to change  the direction of count in bi-directional mode. Software can write to set or clear this bit at any time. This bit  applies to both the higher and lower registers when the UNIFY bit  is set.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>AUTOLIMIT_H</name>
					<description>A one in this bit will cause a match on match register 0 to be treated  as a de-facto LIMIT condition without the need to define an  associated event. As with any LIMIT event, this automatic limit causes the  counter to be cleared to zero in uni-directional mode or to change  the direction of count in bi-directional mode. Software can write to set or clear this bit at any time. This bit is  not used when the UNIFY bit is set.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:19]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL</name>
			<description>SCT control register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x00040004</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DOWN_L</name>
					<description>This bit is 1 when the L or unified counter is counting down. Hardware sets this bit   when the counter limit is reached and BIDIR is 1. Hardware clears this bit when the counter reaches 0 or when the counter is counting down and a limit condition occurs.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>STOP_L</name>
					<description>When this bit is 1 and HALT is 0, the L or unified counter does not run but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>HALT_L</name>
					<description>When this bit is 1, the L or unified counter does not run and no events can occur.  A reset sets this bit. When the HALT_L bit is one, the STOP_L bit is cleared. If you want to remove the halt condition and keep the SCT in the stop condition (not running), then you can change the halt and stop condition with one single write to this register. Once set, only software can clear this bit to restore counter operation.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLRCTR_L</name>
					<description>Writing a 1 to this bit clears the L or unified counter. This bit always reads as 0.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>BIDIR_L</name>
					<description>L or unified counter direction select</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_COUNTER_COUNTS_U</name>
							<description>The counter counts up to its limit condition, then is cleared to zero.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_COUNTER_COUNTS_U</name>
							<description>The counter counts up to its limit, then counts down to a limit condition or to 0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PRE_L</name>
					<description>Specifies the factor by which the SCT clock is prescaled to produce the  L or unified counter clock. The counter clock is clocked at the rate of the SCT  clock divided by PRE_L+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>
					<bitRange>[12:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[15:13]</bitRange>
				</field>
				<field>
					<name>DOWN_H</name>
					<description>This bit is 1 when the H counter is counting down. Hardware sets this bit   when the counter limit is reached and BIDIR is 1. Hardware clears this bit when the counter reaches 0 or when the counter is counting down and a limit condition occurs.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>STOP_H</name>
					<description>When this bit is 1 and HALT is 0, the H counter does not run but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>HALT_H</name>
					<description>When this bit is 1, the H counter does not run and no events can occur.  A reset sets this bit. When the HALT_H bit is one, the STOP_H bit is cleared. If you want to remove the halt condition and keep the SCT in the stop condition (not running), then you can change the halt and stop condition with one single write to this register. Once set, this bit can only be cleared by software to restore counter operation.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>CLRCTR_H</name>
					<description>Writing a 1 to this bit clears the H counter. This bit always reads as 0.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>BIDIR_H</name>
					<description>Direction select</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_H_COUNTER_COUNTS</name>
							<description>The H counter counts up to its limit condition, then is cleared to zero.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_H_COUNTER_COUNTS</name>
							<description>The H counter counts up to its limit, then counts down to a limit condition or to 0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PRE_H</name>
					<description>Specifies the factor by which the SCT clock is prescaled to produce the  H counter clock. The counter clock is clocked at the rate of the SCT  clock divided by PRELH+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>
					<bitRange>[28:21]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>LIMIT</name>
			<description>SCT limit register</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LIMMSK_L</name>
					<description>If bit n is one, event n is used as a counter limit event for the L or unified counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>LIMMSK_H</name>
					<description>If bit n is one, event n is used as a counter limit event for the H counter (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HALT</name>
			<description>SCT halt condition register</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HALTMSK_L</name>
					<description>If bit n is one, event n sets the HALT_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>HALTMSK_H</name>
					<description>If bit n is one, event n sets the HALT_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STOP</name>
			<description>SCT stop condition register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STOPMSK_L</name>
					<description>If bit n is one, event n sets the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>STOPMSK_H</name>
					<description>If bit n is one, event n sets the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>START</name>
			<description>SCT start condition register</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STARTMSK_L</name>
					<description>If bit n is one, event n clears the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>STARTMSK_H</name>
					<description>If bit n is one, event n clears the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DITHER</name>
			<description>SCT dither condition register</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DITHMSK_L</name>
					<description>If bit n is one, the event n causes the dither engine to advance to the next element in the dither pattern at the start of the next counter cycle of the 16-bit low counter or the unified counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15). If all bits are set to 0, the dither pattern automatically advances at the start of every new counter cycle.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>DITHMSK_H</name>
					<description>If bit n is one, the event n causes the dither engine to advance to the next element in the dither pattern at the start of the next counter cycle of the 16-bit high counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15). If all bits are set to 0, the dither pattern automatically advances at the start of every new counter cycle.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>COUNT</name>
			<description>SCT counter register</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_L</name>
					<description>When UNIFY = 0, read or write the 16-bit L counter value. When UNIFY = 1, read or write the lower 16 bits of the 32-bit unified counter.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>CTR_H</name>
					<description>When UNIFY = 0, read or write the 16-bit H counter value. When UNIFY = 1, read or write the upper 16 bits of the 32-bit unified counter.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
