cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>STATE</name>
			<description>SCT state register</description>
			<addressOffset>0x044</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATE_L</name>
					<description>State variable.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:5]</bitRange>
				</field>
				<field>
					<name>STATE_H</name>
					<description>State variable.</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INPUT</name>
			<description>SCT input register</description>
			<addressOffset>0x048</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AIN0</name>
					<description>Real-time status of input 0.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>AIN1</name>
					<description>Real-time status of input 1.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AIN2</name>
					<description>Real-time status of input 2.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AIN3</name>
					<description>Real-time status of input 3.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AIN4</name>
					<description>Real-time status of input 4.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>AIN5</name>
					<description>Real-time status of input 5.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>AIN6</name>
					<description>Real-time status of input 6.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>AIN7</name>
					<description>Real-time status of input 7.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SIN0</name>
					<description>Input 0 state synchronized to the SCT clock.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>SIN1</name>
					<description>Input 1 state synchronized to the SCT clock.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>SIN2</name>
					<description>Input 2 state synchronized to the SCT clock.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>SIN3</name>
					<description>Input 3 state synchronized to the SCT clock.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>SIN4</name>
					<description>Input 4 state synchronized to the SCT clock.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>SIN5</name>
					<description>Input 5 state synchronized to the SCT clock.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>SIN6</name>
					<description>Input 6 state synchronized to the SCT clock.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>SIN7</name>
					<description>Input 7 state synchronized to the SCT clock.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>REGMODE</name>
			<description>SCT match/capture registers mode register</description>
			<addressOffset>0x04C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>REGMOD_L</name>
					<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>REGMOD_H</name>
					<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>OUTPUT</name>
			<description>SCT output register</description>
			<addressOffset>0x050</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>OUT</name>
					<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 9 = bit 9).</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>OUTPUTDIRCTRL</name>
			<description>SCT output counter direction control register</description>
			<addressOffset>0x054</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SETCLR0</name>
					<description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR1</name>
					<description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR2</name>
					<description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR3</name>
					<description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR4</name>
					<description>Set/clear operation on output 4. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR5</name>
					<description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR6</name>
					<description>Set/clear operation on output 6. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[13:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR7</name>
					<description>Set/clear operation on output 7. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[15:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR8</name>
					<description>Set/clear operation on output 8. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[17:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR9</name>
					<description>Set/clear operation on output 9. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[19:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:20]</bitRange>
				</field>
			</fields>
		</register>
