cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
	</registers>
		</peripheral>
		<peripheral derivedFrom="SCT0">
			<name>SCT1</name>
			<description>SCT1</description>
			<baseAddress>0x1C01C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCT1</name>
				<value>17</value>
			</interrupt>
		</peripheral>
<peripheral>
	<name>SCT2</name>
	<description>Small State Configurable Timers 2/3 (SCT2/3) </description>
	<groupName>SCT2</groupName>
	<baseAddress>0x1C020000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SCT2</name>
	<value>18</value>
	</interrupt>
	<registers>
		<register>
			<name>CONFIG</name>
			<description>SCT configuration register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x00007E00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>UNIFY</name>
					<description>SCT operation</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_SCT_OPERATES_AS</name>
							<description>The SCT operates as two 16-bit counters named L and H.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SCT_OPERATES_AS</name>
							<description>The SCT operates as a unified 32-bit counter.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKMODE</name>
					<description>SCT clock mode</description>
					<bitRange>[2:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_BUS_CLOCK_CLOCKS</name>
							<description>The bus clock clocks the SCT and prescalers.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SCT_CLOCK_IS_THE</name>
							<description>The SCT clock is the bus clock, but the prescalers are  enabled to count only when sampling of the input selected by  the CKSEL field finds the selected edge. The minimum pulse  width on the clock input is 1 bus clock period. This mode is the high-performance  sampled-clock mode.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_INPUT_SELECTED_B</name>
							<description>The input selected by  CKSEL clocks the SCT and prescalers. The input is synchronized to the bus clock and possibly inverted.  The minimum pulse width on the clock input is 1 bus clock  period. This mode is the low-power sampled-clock mode.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.This is not reserved on the LPC15xx. Need to add back in from spec.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CKSEL</name>
					<description>SCT clock select</description>
					<bitRange>[6:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 0.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 1.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 1.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 2.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 2.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 3.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 3.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NORELAOD_L</name>
					<description>A 1 in this bit prevents the lower match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit applies to both the  higher and lower registers when the UNIFY bit is set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>NORELOAD_H</name>
					<description>A 1 in this bit prevents the higher match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit is not used when  the UNIFY bit is set.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>INSYNC</name>
					<description>Synchronization for input N (bit 9 = input 0, bit 10 = input 1,..., bit 16 = input 7). A 1 in one of these bits subjects the corresponding input to  synchronization to the SCT clock, before it is used to create an  event. If an input is synchronous to the SCT clock, keep its bit 0 for  faster response. When the CKMODE field is 1x, the bit in this field, corresponding  to the input selected by the CKSEL field, is not used.</description>
					<bitRange>[16:9]</bitRange>
				</field>
				<field>
					<name>AUTOLIMIT_L</name>
					<description>A one in this bit causes a match on match register 0 to be treated  as a de-facto LIMIT condition without the need to define an  associated event. As with any LIMIT event, this automatic limit causes the  counter to be cleared to zero in uni-directional mode or to change  the direction of count in bi-directional mode. Software can write to set or clear this bit at any time. This bit  applies to both the higher and lower registers when the UNIFY bit  is set.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>AUTOLIMIT_H</name>
					<description>A one in this bit will cause a match on match register 0 to be treated  as a de-facto LIMIT condition without the need to define an  associated event. As with any LIMIT event, this automatic limit causes the  counter to be cleared to zero in uni-directional mode or to change  the direction of count in bi-directional mode. Software can write to set or clear this bit at any time. This bit is  not used when the UNIFY bit is set.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:19]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL</name>
			<description>SCT control register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x00040004</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DOWN_L</name>
					<description>This bit is 1 when the L or unified counter is counting down. Hardware sets this bit   when the counter limit is reached and BIDIR is 1. Hardware clears this bit when the counter is counting down and a limit condition occurs or when the counter reaches 0.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>STOP_L</name>
					<description>When this bit is 1 and HALT is 0, the L or unified counter does not run, but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>HALT_L</name>
					<description>When this bit is 1, the L or unified counter does not run and no events can occur.  A reset sets this bit. When the HALT_L bit is one, the STOP_L bit is cleared. If you want to remove the halt condition and keep the SCT in the stop condition (not running), then you can change the halt and stop condition with one single write to this register. Once set, only software can clear this bit to restore counter operation.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLRCTR_L</name>
					<description>Writing a 1 to this bit clears the L or unified counter. This bit always reads as 0.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>BIDIR_L</name>
					<description>L or unified counter direction select</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_COUNTER_COUNTS_U</name>
							<description>The counter counts up to its limit condition, then is cleared to zero.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_COUNTER_COUNTS_U</name>
							<description>The counter counts up to its limit, then counts down to a limit condition or to 0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PRE_L</name>
					<description>Specifies the factor by which the SCT clock is prescaled to produce the  L or unified counter clock. The counter clock is clocked at the rate of the SCT  clock divided by PRE_L+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>
					<bitRange>[12:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[15:13]</bitRange>
				</field>
				<field>
					<name>DOWN_H</name>
					<description>This bit is 1 when the H counter is counting down. Hardware sets this bit   when the counter limit is reached and BIDIR is 1. Hardware clears this bit when the counter is counting down and a limit condition occurs or when the counter reaches 0.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>STOP_H</name>
					<description>When this bit is 1 and HALT is 0, the H counter does not, run but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>HALT_H</name>
					<description>When this bit is 1, the H counter does not run and no events can occur.  A reset sets this bit. When the HALT_H bit is one, the STOP_H bit is cleared. If you want to remove the halt condition and keep the SCT in the stop condition (not running), then you can change the halt and stop condition with one single write to this register. Once set, this bit can only be cleared by software to restore counter operation.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>CLRCTR_H</name>
					<description>Writing a 1 to this bit clears the H counter. This bit always reads as 0.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>BIDIR_H</name>
					<description>Direction select</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_H_COUNTER_COUNTS</name>
							<description>The H counter counts up to its limit condition, then is cleared to zero.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_H_COUNTER_COUNTS</name>
							<description>The H counter counts up to its limit, then counts down to a limit condition or to 0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PRE_H</name>
					<description>Specifies the factor by which the SCT clock is prescaled to produce the  H counter clock. The counter clock is clocked at the rate of the SCT  clock divided by PRELH+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>
					<bitRange>[28:21]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>LIMIT</name>
			<description>SCT limit register</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LIMMSK_L</name>
					<description>If bit n is one, event n is used as a counter limit for the L or unified counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>LIMMSK_H</name>
					<description>If bit n is one, event n is used as a counter limit for the H counter (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HALT</name>
			<description>SCT halt condition register</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HALTMSK_L</name>
					<description>If bit n is one, event n sets the HALT_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>HALTMSK_H</name>
					<description>If bit n is one, event n sets the HALT_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STOP</name>
			<description>SCT stop condition register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STOPMSK_L</name>
					<description>If bit n is one, event n sets the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>STOPMSK_H</name>
					<description>If bit n is one, event n sets the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>START</name>
			<description>SCT start condition register</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STARTMSK_L</name>
					<description>If bit n is one, event n clears the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>STARTMSK_H</name>
					<description>If bit n is one, event n clears the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>COUNT</name>
			<description>SCT counter register</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_L</name>
					<description>When UNIFY = 0, read or write the 16-bit L counter value. When UNIFY = 1, read or write the lower 16 bits of the 32-bit unified counter.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>CTR_H</name>
					<description>When UNIFY = 0, read or write the 16-bit H counter value. When UNIFY = 1, read or write the upper 16 bits of the 32-bit unified counter.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STATE</name>
			<description>SCT state register</description>
			<addressOffset>0x044</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATE_L</name>
					<description>State variable.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:5]</bitRange>
				</field>
				<field>
					<name>STATE_H</name>
					<description>State variable.</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INPUT</name>
			<description>SCT input register</description>
			<addressOffset>0x048</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AIN0</name>
					<description>Real-time status of input 0.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>AIN1</name>
					<description>Real-time status of input 1.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AIN2</name>
					<description>Real-time status of input 2.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AIN3</name>
					<description>Real-time status of input 3.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:4]</bitRange>
				</field>
				<field>
					<name>SIN0</name>
					<description>Input 0 state synchronized to the SCT clock.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>SIN1</name>
					<description>Input 1 state synchronized to the SCT clock.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>SIN2</name>
					<description>Input 2 state synchronized to the SCT clock.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>SIN3</name>
					<description>Input 3 state synchronized to the SCT clock.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:20]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>REGMODE</name>
			<description>SCT match/capture registers mode register</description>
			<addressOffset>0x04C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>REGMOD_L</name>
					<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>REGMOD_H</name>
					<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>OUTPUT</name>
			<description>SCT output register</description>
			<addressOffset>0x050</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>OUT</name>
					<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 5 = bit 5).</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
