cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>OUTPUTDIRCTRL</name>
			<description>SCT output counter direction control register</description>
			<addressOffset>0x054</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SETCLR0</name>
					<description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR1</name>
					<description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR2</name>
					<description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR3</name>
					<description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR4</name>
					<description>Set/clear operation on output 4. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR5</name>
					<description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RES</name>
			<description>SCT conflict resolution register</description>
			<addressOffset>0x058</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>O0RES</name>
					<description>Effect of simultaneous set and clear on output 0.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_OUTPUT_OR_CLEAR</name>
							<description>Set output (or clear based on the SETCLR0 field).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_OUTPUT_OR_SET</name>
							<description>Clear output (or set based on the SETCLR0 field).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_OUTPUT</name>
							<description>Toggle output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>O1RES</name>
					<description>Effect of simultaneous set and clear on output 1.</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_OUTPUT_OR_CLEAR</name>
							<description>Set output (or clear based on the SETCLR1 field).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_OUTPUT_OR_SET</name>
							<description>Clear output (or set based on the SETCLR1 field).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_OUTPUT</name>
							<description>Toggle output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>O2RES</name>
					<description>Effect of simultaneous set and clear on output 2.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_OUTPUT_OR_CLEAR</name>
							<description>Set output (or clear based on the SETCLR2 field).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_OUTPUT_N_OR_S</name>
							<description>Clear output n (or set based on the SETCLR2 field).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_OUTPUT</name>
							<description>Toggle output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>O3RES</name>
					<description>Effect of simultaneous set and clear on output 3.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_OUTPUT_OR_CLEAR</name>
							<description>Set output (or clear based on the SETCLR3 field).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_OUTPUT_OR_SET</name>
							<description>Clear output (or set based on the SETCLR3 field).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_OUTPUT</name>
							<description>Toggle output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>O4RES</name>
					<description>Effect of simultaneous set and clear on output 4.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_OUTPUT_OR_CLEAR</name>
							<description>Set output (or clear based on the SETCLR4 field).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_OUTPUT_OR_SET</name>
							<description>Clear output (or set based on the SETCLR4 field).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_OUTPUT</name>
							<description>Toggle output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>O5RES</name>
					<description>Effect of simultaneous set and clear on output 5.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_OUTPUT_OR_CLEAR</name>
							<description>Set output (or clear based on the SETCLR5 field).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_OUTPUT_OR_SET</name>
							<description>Clear output (or set based on the SETCLR5 field).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_OUTPUT</name>
							<description>Toggle output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMAREQ0</name>
			<description>SCT DMA request 0 register</description>
			<addressOffset>0x05C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DEV_0</name>
					<description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:16]</bitRange>
				</field>
				<field>
					<name>DRL0</name>
					<description>A 1 in this bit makes the SCT set DMA request 0 when it loads the  Match_L/Unified registers from the Reload_L/Unified registers.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>DRQ0</name>
					<description>This read-only bit indicates the state of DMA Request 0</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMAREQ1</name>
			<description>SCT DMA request 1 register</description>
			<addressOffset>0x060</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DEV_1</name>
					<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:16]</bitRange>
				</field>
				<field>
					<name>DRL1</name>
					<description>A 1 in this bit makes the SCT set DMA request 1 when it loads the  Match L/Unified registers from the Reload L/Unified registers.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>DRQ1</name>
					<description>This read-only bit indicates the state of DMA Request 1.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EVEN</name>
			<description>SCT event enable register</description>
			<addressOffset>0x0F0</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IEN</name>
					<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EVFLAG</name>
			<description>SCT event flag register</description>
			<addressOffset>0x0F4</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FLAG</name>
					<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CONEN</name>
			<description>SCT conflict enable register</description>
			<addressOffset>0x0F8</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NCEN</name>
					<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CONFLAG</name>
			<description>SCT conflict flag register</description>
			<addressOffset>0x0FC</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NCFLAG</name>
					<description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 5 = bit 5).</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[29:6]</bitRange>
				</field>
				<field>
					<name>BUSERRL</name>
					<description>The most recent bus error from this SCT involved writing CTR  L/Unified, STATE L/Unified, MATCH L/Unified, or the Output register when the  L/U counter was not halted. A word write to certain L  and H registers can be half successful and half unsuccessful.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>BUSERRH</name>
					<description>The most recent bus error from this SCT involved writing CTR H,  STATE H, MATCH H, or the Output register when the H  counter was not halted.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>8</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-7</dimIndex>
			<name>MATCH%s</name>
			<description>SCT match value register of match channels 0 to 7; REGMOD0 to REGMODE7 = 0</description>
			<addressOffset>0x100</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MATCHn_L</name>
					<description>When UNIFY = 0, read or write the 16-bit value to be  compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>MATCHn_H</name>
					<description>When UNIFY = 0, read or write the 16-bit value to be  compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>8</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-7</dimIndex>
			<name>CAP%s</name>
			<description>SCT capture register of capture channel 0 to 7; REGMOD0 to REGMODE7 = 1</description>
			<alternateRegister>MATCH%s</alternateRegister>
			<addressOffset>0x100</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAPn_L</name>
					<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>CAPn_H</name>
					<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>8</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-7</dimIndex>
			<name>MATCHREL%s</name>
			<description>SCT match reload value register 0 to 7; REGMOD0 = 0 to REGMODE7 = 0</description>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RELOADn_L</name>
					<description>When UNIFY = 0, read or write the 16-bit value to be loaded into the SCTMATCHn_L register. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be loaded into the MATCHn register.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RELOADn_H</name>
					<description>When UNIFY = 0, read or write the 16-bit to be loaded into the MATCHn_H register. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be loaded into the MATCHn register.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>8</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-7</dimIndex>
			<name>CAPCTRL%s</name>
			<description>SCT capture control register 0 to 7; REGMOD0 = 1 to REGMODE7 = 1</description>
			<alternateRegister>MATCHREL%s</alternateRegister>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAPCONn_L</name>
					<description>If bit m is one, event m causes the CAPn_L (UNIFY = 0) or the CAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 9 = bit 9).</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:10]</bitRange>
				</field>
				<field>
					<name>CAPCONn_H</name>
					<description>If bit m is one, event m causes the CAPn_H (UNIFY = 0) register to be loaded (event 0 = bit 16, event 1 = bit 17,..., event 9 = bit 24).</description>
					<bitRange>[24:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:25]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>10</dim>
			<dimIncrement>0x8</dimIncrement>
			<dimIndex>0-9</dimIndex>
			<name>EV%s_STATE</name>
			<description>SCT event state register 0</description>
			<addressOffset>0x300</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATEMSKn</name>
					<description>If bit m is one, event n (n= 0 to 9) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 9 = bit 9).</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
