cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
			</registers>
		</peripheral>
		<peripheral>
	<name>ACMP</name>
	<description>Analog comparators ACMP0/1/2/3</description>
	<groupName>ACMP</groupName>
	<baseAddress>0x40008000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>CMP0</name>
	<value>40</value>
	</interrupt>
	<interrupt>
	<name>CMP1</name>
	<value>41</value>
	</interrupt>
	<interrupt>
	<name>CMP2</name>
	<value>42</value>
	</interrupt>
	<interrupt>
	<name>CMP3</name>
	<value>43</value>
	</interrupt>
	<registers>
		<register>
			<name>CTRL</name>
			<description>Comparator block control register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>ROSCCTL</name>
					<description>Selects the which comparators set and reset the ROSC output.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ACMP1_ACMP0</name>
							<description>ACMP1/ACMP0. The ROSC output is set by ACMP1 and reset by ACMP0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_ACMP1</name>
							<description>ACMP0/ACMP1. The ROSC output is set by ACMP0 and reset by ACMP1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EXT_RESET</name>
					<description>Selects the reset source for the ROSC output.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INTERNAL</name>
							<description>Internal. The ROSC output is reset by the internal chip reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FROM_PIN_ROSC_RESET</name>
							<description>From pin ROSC_RESET. The ROSC output is reset by the ROSC_RESET input.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CMP0</name>
			<description>Comparator 0 source control</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EN</name>
					<description>Comparator enable control.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Comparator disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Comparator is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>INTEN</name>
					<description>Interrupt enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Interrupts are disabled..</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Interrupts are enabled.. Must set to 1 for interrupts to propagate to the NVIC and start-up logic.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>STAT</name>
					<description>Comparator status. This bit reflects the comparator output</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>VM</name>
					<description>VM input select.</description>
					<bitRange>[6:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_0</name>
							<description>Vref divider 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I1</name>
							<description>ACMP_I1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I2</name>
							<description>ACMP_I2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_I3</name>
							<description>ACMP0_I3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_I4</name>
							<description>ACMP0_I4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0</name>
							<description>Internal 0.9 V band gap reference.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEMP_SENSOR</name>
							<description>Temp sensor.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC0_2</name>
							<description>ADC0_2. Input for ADC0 channel 2.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>VP</name>
					<description>VP input select.</description>
					<bitRange>[10:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_0</name>
							<description>Vref divider 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I1</name>
							<description>ACMP_I1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I2</name>
							<description>ACMP_I2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_I3</name>
							<description>ACMP0_I3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_I4</name>
							<description>ACMP0_I4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0</name>
							<description>Internal 0.9 V band gap reference.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEMP_SENSOR</name>
							<description>Temp sensor.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC0_2</name>
							<description>ADC0_2. Input for ADC0 channel 2.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[12:11]</bitRange>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis control. When enabled, hysteresis determines the difference required between the comparator inputs before the comparator output switches. The difference must be in the direction opposite of the current comparator output.</description>
					<bitRange>[14:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>HYSTERESIS_IS_TURNED</name>
							<description>Hysteresis is turned off, comparator output will change as the input voltages cross.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_5_MV</name>
							<description>Hysteresis = 5 mV.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_10_MV</name>
							<description>Hysteresis = 10 mV.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_15_MV</name>
							<description>Hysteresis = 15 mV.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTPOL</name>
					<description>Selects the polarity of the CMP output for purposes of generating level interrupts.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_INVERTED</name>
							<description>Not inverted. The output is used as-is for generating interrupts.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INVERTED</name>
							<description>Inverted. The output is used inverted for generating interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTTYPE</name>
					<description>Select interrupt type.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EDGE</name>
							<description>Edge. Comparator interrupt is edge triggered.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL</name>
							<description>Level. Comparator interrupt is level triggered.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTEDGE</name>
					<description>Select edge triggered interrupt to be active on either high or low transitions, when INTTYPE = 0.</description>
					<bitRange>[18:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FALLING</name>
							<description>Falling. Comparator interrupt is active on falling edges.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING</name>
							<description>Rising. Comparator interrupt is active on rising edges.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_EDGES</name>
							<description>Both edges. Comparator Interrupt is active on both edges.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTFLAG</name>
					<description>Interrupt flag.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_PENDING</name>
							<description>Not pending. The Comparator interrupt is not pending.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING</name>
							<description>Pending. The Comparator interrupt is pending. Writing a 1 to this bit clears the flag.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>VLADEN</name>
					<description>Voltage ladder enable for comparator 0.</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The Comparator voltage ladder is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The Comparator voltage ladder is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>VLADREF</name>
					<description>Voltage reference select for comparator 0 voltage ladder.</description>
					<bitRange>[22:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_CMP_PIN</name>
							<description>VREF_CMP pin.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VDDA_PIN</name>
							<description>VDDA pin.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>VSEL</name>
					<description>Voltage ladder value for comparator 0. The reference voltage Vref depends on the setting of VLADREF (either VDD(3V3) or voltage on pin VREF_CMP). 00000 = Vss. 00001 = 1 x Vref / 31. 00010 = 2 x Vref / 31. ... 11111 = Vref</description>
					<bitRange>[28:24]</bitRange>
				</field>
				<field>
					<name>DLY</name>
					<description>Configure the propagation delay. A shorter propagation delay means higher power consumption. Use values from 0x0 (shortest propagation delay and highest power consumption) to 0x2 (longest propagation delay and lowest power consumption). See the  data sheet for details.</description>
					<bitRange>[30:29]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
