cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
	</registers>
</peripheral>
		<peripheral>
			<name>INMUX</name>
			<description>Input multiplexing (INMUX) </description>
			<groupName>INMUX</groupName>
			<baseAddress>0x40014000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>7</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-6</dimIndex>
					<name>SCT0_INMUX[%s]</name>
					<displayName>SCT0_INMUX[%s]</displayName>
					<description>Pinmux register for SCT0 input 0</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Input number (decimal value) to SCT0 inputs 0 to 6.  0 = 	PIO0_2 (external pin) 1	 = PIO0_3 (external pin) 2	 = PIO0_17 (external pin) 3	 = PIO0_30 (external pin) 4	 = PIO1_6 (external pin) 5	 = PIO1_7 (external pin) 6	 = PIO1_12 (external pin) 7 = 	PIO1_13 (external pin) 8	 = SCT1_OUT4 (large SCT1 output 4) 9 = 	SCT2_OUT4 (companion small SCT2 output 4) 10 = 	SCT2_OUT5 (companion small SCT2 output 5) 11	 = ADC0_THCMP_IRQ () 12	 = ADC1_THCMP_IRQ () 13	 = COMP0_OUT (One output from each analog comparator) 14	 = COMP1_OUT 15	 = COMP2_OUT 16	 = COMP3_OUT 17	 = SCTIPU_ABORT 18	 = SCTIPU_SAMPLE0 19	 = SCTIPU_SAMPLE1 20 = 	SCTIPU_SAMPLE2 21	 = SCTIPU_SAMPLE3 22 = 	DEBUG_HALTED (from ARM Cortex CoreSight Debugger)</description>
							<bitRange>[4:0]</bitRange>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIO0_2</name>
									<description>PIO0_2 (external pin)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO0_3</name>
									<description>PIO0_3 (external pin)</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO0_17</name>
									<description>PIO0_17 (external pin)</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO0_30</name>
									<description>PIO0_30 (external pin)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_6</name>
									<description>PIO1_6 (external pin)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_7</name>
									<description>PIO1_7 (external pin)</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_12</name>
									<description>PIO1_12 (external pin)</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_13</name>
									<description>PIO1_13 (external pin)</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCT1_OUT4</name>
									<description>SCT1_OUT4 (large SCT1 output 4)</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCT2_OUT4</name>
									<description>SCT2_OUT4 (small SCT2 output 4)</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCT2_OUT5</name>
									<description>SCT2_OUT5 (small SCT2 output 5)</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_THCMP_IRQ</name>
									<description>ADC0_THCMP_IRQ (ADC0 threshold compare interrupt)</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC1_THCMP_IRQ</name>
									<description>ADC1_THCMP_IRQ (ADC1 threshold compare interrupt)</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP0_OUT</name>
									<description>ACMP0_OUT (One output from each analog comparator)</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP1_OUT</name>
									<description>ACMP1_OUT (One output from each analog comparator)</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP2_OUT</name>
									<description>ACMP2_OUT (One output from each analog comparator)</description>
									<value>0xF</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP3_OUT</name>
									<description>ACMP3_OUT (One output from each analog comparator)</description>
									<value>0x10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_ABORT</name>
									<description>SCTIPU_ABORT</description>
									<value>0x11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE0</name>
									<description>SCTIPU_SAMPLE0</description>
									<value>0x12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE1</name>
									<description>SCTIPU_SAMPLE1</description>
									<value>0x13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE2</name>
									<description>SCTIPU_SAMPLE2</description>
									<value>0x14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE3</name>
									<description>SCTIPU_SAMPLE3</description>
									<value>0x15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEBUG_HALTED</name>
									<description>ARM DEBUG HALTED</description>
									<value>0x16</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>7</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-6</dimIndex>
					<name>SCT1_INMUX[%s]</name>
					<displayName>SCT1_INMUX[%s]</displayName>
					<description>Pinmux register for SCT1 input 0</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Input number (decimal value) to SCT1 inputs 0 to 6.  0	 = PIO0_15 (external pin) 1	 = PIO0_16 (external pin) 2	 = PIO0_21 (external pin) 3	 = PIO0_31 (external pin) 4	 = PIO1_4 (external pin) 5 = PIO1_5 (external pin) 6	 = PIO1_15 (external pin) 7	 = PIO1_16 (external pin) 8	 = SCT0_OUT4 (large SCT0 output 4) 9	 = SCT3_OUT4 (small companion SCT3 output 4) 10 = 	SCT3_OUT5 (small companion SCT3 output 5) 11 = 	ADC0_THCMP_IRQ 12	 = ADC1_THCMP_IRQ 13	 = COMP0_OUT (One output from each analog comparator) 14	 = COMP1_OUT 15	 = COMP2_OUT 16 = A	COMP3_OUT 17	 = SCTIPU_ABORT 18	 = SCTIPU_SAMPLE0 19	 = SCTIPU_SAMPLE1 20	 = SCTIPU_SAMPLE2 21	 = SCTIPU_SAMPLE3 22	 = DEBUG_HALTED DEBUG_HALTED (from ARM Cortex CoreSight Debugger)</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>SCT2_INMUX[%s]</name>
					<displayName>SCT2_INMUX[%s]</displayName>
					<description>Pinmux register for SCT2 input 0</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Input number (decimal value) to SCT2 inputs 0 to 2.  0	 = P0_4 (external pin) 1	 = P0_27 (external pin) 2	 = P1_18 (external pin) 3	 = P1_19 (external pin) 4	 = SCT0_OUT4 5	= SCT0_OUT5 6	= SCT0_OUT7 7 = 	SCT0_OUT8 8	 = ADC0_THCMP_IRQ 9	= ADC1_THCMP_IRQ 10	 = COMP0_OUT (One output from each analog comparator) 11	 = COMP1_OUT 12	 = COMP2_OUT 13	 = COMP3_OUT 14	 = SCTIPU_ABORT 15	 = SCTIPU_SAMPLE0 16	 = SCTIPU_SAMPLE1 17	 = SCTIPU_SAMPLE2 18	 = SCTIPU_SAMPLE3 19	 = USB_FRAME_TOGGLE 20	 = DEBUG_HALTED</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>SCT3_INMUX[%s]</name>
					<displayName>SCT3_INMUX[%s]</displayName>
					<description>Pinmux register for SCT3 input 0</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Input number (decimal value) to SCT3 inputs 0 to 2.   0	 = PIO0_7 1	 = PIO1_11 2	 = PIO1_21 3	 = PIO1_22 4	 = SCT1_OUT4 5	 = SCT1_OUT5 6	 = SCT1_OUT7 7	 = SCT1_OUT8 8	 = ADC0_THCMP_IRQ 9	 = ADC1_THCMP_IRQ 10	 = COMP0_OUT 11	 = COMP1_OUT 12	 = COMP2_OUT 13	 = COMP3_OUT 14	 = SCTIPU_ABORT3 15	 = SCTIPU_SAMPLE0 16	 = SCTIPU_SAMPLE1 17	 = SCTIPU_SAMPLE2 18	 = SCTIPU_SAMPLE3 19	 = USB_FRAME_TOGGLE 20	 = DEBUG_HALTED</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>PINTSEL[%s]</name>
					<displayName>PINTSEL[%s]</displayName>
					<description>Pin interrupt select register 0</description>
					<addressOffset>0x0C0</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x7F</resetMask>
					<fields>
						<field>
							<name>INTPIN</name>
							<description>Pin number select for pin interrupt or pattern match engine input. (PIO0_0 to PIO1_31 correspond to numbers 0 to 63).</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>18</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-17</dimIndex>
					<name>DMA_ITRIG_INMUX[%s]</name>
					<displayName>DMA_ITRIG_INMUX[%s]</displayName>
					<description>Trigger input for DMA channel 0 select register.</description>
					<addressOffset>0x0E0</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Trigger input number (decimal value) to DMA channel n.   0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = ADC1_SEQA_IRQ 3 = 	ADC1_SEQB_IRQ 4	 = SCT0_DMA0 5	 = SCT0_DMA1 6	 = SCT1_DMA0 7 = 	SCT1_DMA1 8 = 	SCT2_DMA0 9 = 	SCT2_DMA1 10	 = SCT3_DMA0 11	 = SCT3_DMA1 12	 = COMP0_OUT (One output from each analog comparator) 13	 = COMP1_OUT 14	 = COMP2_OUT 15 = 	COMP3_OUT 16	 = SDMA_TRIGOUT_A 17	 = SDMA_TRIGOUT_B 18	 = SDMA_TRIGOUT_C 19 = 	SDMA_TRIGOUT_D</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>DMA_INMUX_INMUX[%s]</name>
					<displayName>DMA_INMUX_INMUX[%s]</displayName>
					<description>DMA trigger input select register.</description>
					<addressOffset>0x140</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP</name>
							<description>DMA trigger output number</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FREQMEAS_REF</name>
					<description>Clock selection for frequency measurement function reference clock</description>
					<addressOffset>0x160</addressOffset>
					<access>read-write</access>
					<resetValue>0xF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKIN</name>
							<description>Clock source number (decimal value) for frequency measure function target clock: 0	 = System oscilator (MAIN_OSC) 1 = 	IRC 2	 = WDOSC 3	 = 32KHZOSC 4	 = USB_FTOGGLE 5	 = PIO0_5 6	 = PIO0_19 7	 = PIO0_30 8 = PIO1_27</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FREQMEAS_TARGET</name>
					<description>Clock selection for frequency measurement function target clock</description>
					<addressOffset>0x164</addressOffset>
					<access>read-write</access>
					<resetValue>0xF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKIN</name>
							<description>Clock source number (decimal value) for frequency measure function target clock: 0	 = System oscillator (MAIN_OSC) 1 = 	IRC 2	 = WDOSC 3	 = 32KHZOSC 4	 = USB_FTOGGLE 5	 = PIO0_5 6	 = PIO0_19 7	 = PIO0_30 8 = PIO1_27</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
