cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
			</registers>
		</peripheral>
		<peripheral>
	<name>SWM</name>
	<description>Switch Matrix (SWM)</description>
	<groupName>SWM</groupName>
	<baseAddress>0x40038000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
		<register>
			<name>PINASSIGN0</name>
			<description>Pin assign register 0. Assign movable functions U0_TXD, U0_RXD, U0_RTS, U0_CTS.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>UART0_TXD_O</name>
					<description>UART0_TXD function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>UART0_RXD_I</name>
					<description>UART0_RXD function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>UART0_RTS_O</name>
					<description>UART0_RTS function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>UART0_CTS_I</name>
					<description>UART0_CTS function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN1</name>
			<description>Pin assign register 1. Assign movable functions U0_SCLK, U1_TXD, U1_RXD, U1_RTS.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>UART0_SCLK_IO</name>
					<description>UART0_SCLK function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>UART1_TXD_O</name>
					<description>UART1_TXD function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>UART1_RXD_I</name>
					<description>UART1_RXD function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>UART1_RTS_O</name>
					<description>UART1_RTS function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN2</name>
			<description>Pin assign register 2. Assign movable functions U1_CTS, U1_SCLK, U2_TXD, U2_RXD.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>UART1_CTS_I</name>
					<description>UART1_CTS function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>UART1_SCLK_IO</name>
					<description>UART1_SCLK function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>UART2_TXD_O</name>
					<description>UART2_TXD function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>UART2_RXD_I</name>
					<description>UART2_RXD function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN3</name>
			<description>Pin assign register 3. Assign movable function .</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>UART2_SCLK_IO</name>
					<description>UART2_SCLK function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SSP0_SCK_IO</name>
					<description>SSP0_SCK function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SSP0_MOSI_IO</name>
					<description>SSP0_MOSI function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>SSP0_MISO_IO</name>
					<description>SSP0_MISO function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN4</name>
			<description>Pin assign register 4. Assign movable functions</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSP0_SSELSN_0_IO</name>
					<description>SSP0_SSELSN_0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SSP0_SSELSN_1_IO</name>
					<description>SSP0_SSELSN_1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SSP0_SSELSN_2_IO</name>
					<description>SSP0_SSELSN_2 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>SSP0_SSELSN_3_IO</name>
					<description>SSP0_SSELSN_3 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN5</name>
			<description>Pin assign register 5. Assign movable functions</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSP1_SCK_IO</name>
					<description>SSP1_SCK function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SSP1_MOSI_IO</name>
					<description>SSP1_MOSI function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SSP1_MISO_IO</name>
					<description>SSP1_MISO function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>SSP1_SSELSN_0_IO</name>
					<description>SSP1_SSELSN_0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN6</name>
			<description>Pin assign register 6. Assign movable functions</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSP1_SSELSN_1_IO</name>
					<description>SSP1_SSELSN_1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>CAN_TD1_O</name>
					<description>CAN_TD1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>CAN_RD1_I</name>
					<description>CAN_RD1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>USB_CONNECTN_O</name>
					<description>USB_CONNECTN function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN7</name>
			<description>Pin assign register 7. Assign movable functions</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>USB_VBUS_I</name>
					<description>USB_VBUS function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SCT0_OUT0_O</name>
					<description>SCT0_OUT0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SCT0_OUT1_O</name>
					<description>SCT0_OUT1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>SCT0_OUT2_O</name>
					<description>SCT0_OUT2 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN8</name>
			<description>Pin assign register 8. Assign movable functions</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCT1_OUT0_O</name>
					<description>SCT1_OUT0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SCT1_OUT1_O</name>
					<description>SCT1_OUT1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SCT1_OUT2_O</name>
					<description>SCT1_OUT2 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>SCT2_OUT0_O</name>
					<description>SCT2_OUT0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN9</name>
			<description>Pin assign register 9. Assign movable functions</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCT2_OUT1_O</name>
					<description>SCT2_OUT1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SCT2_OUT2_O</name>
					<description>SCT2_OUT2 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SCT3_OUT0_O</name>
					<description>SCT3_OUT0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>SCT3_OUT1_O</name>
					<description>SCT3_OUT1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN10</name>
			<description>Pin assign register 10. Assign movable functions</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCT3_OUT2_O</name>
					<description>SCT3_OUT2 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SCT_ABORT0_I</name>
					<description>SCT_ABORT0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>SCT_ABORT1_I</name>
					<description>SCT_ABORT1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>ADC0_PIN_TRIG0_I</name>
					<description>ADC0_PIN_TRIG0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN11</name>
			<description>Pin assign register 11. Assign movable functions</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ADC0_PIN_TRIG1_I</name>
					<description>ADC0_PIN_TRIG1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>ADC1_PIN_TRIG0_I</name>
					<description>ADC1_PIN_TRIG0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>ADC1_PIN_TRIG1_I</name>
					<description>ADC1_PIN_TRIG1 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>DAC_PIN_TRIG_I</name>
					<description>DAC_PIN_TRIG function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN12</name>
			<description>Pin assign register 12. Assign movable functions</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DAC_SHUTOFF_I</name>
					<description>DAC_SHUTOFF function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>ACMP0_OUT_O</name>
					<description>ACMP0_OUT function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>ACMP1_OUT_O</name>
					<description>ACMP1_OUT function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>ACMP2_OUT_O</name>
					<description>ACMP2_OUT function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN13</name>
			<description>Pin assign register 13. Assign movable functions</description>
			<addressOffset>0x034</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ACMP3_OUT_O</name>
					<description>ACMP3_OUT function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>CLK_OUT_O</name>
					<description>CLK_OUT function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>ROSC0_O</name>
					<description>ROSC0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>ROSC_RST0_I</name>
					<description>ROSC_RST0 function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN14</name>
			<description>Pin assign register 14. Assign movable functions</description>
			<addressOffset>0x038</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>USB_FRAME_TOG_O</name>
					<description>USB_FRAME_TOG function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>QEI0_PHA_I</name>
					<description>QEI0_PHA function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>QEI0_PHB_I</name>
					<description>QEI0_PHB function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>QEI0_IDX_I</name>
					<description>QEI0_IDX function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PINASSIGN15</name>
			<description>Pin assign register 15. Assign movable functions</description>
			<addressOffset>0x03C</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>GPIO_INT_BMATCH_O</name>
					<description>GPIO_INT_BMATCH function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SWO_O</name>
					<description>SWO function assignment. The value is the pin number to be assigned to this function. PIO0_0 = 0, ..., PIO1_0 = 32, ..., PIO2_11 = 75.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
