cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>PINENABLE1</name>
			<description>Pin enable register 0. Enables fixed-pin functions</description>
			<addressOffset>0x1C4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>ACMP2_I4</name>
					<description>Analog comparator 2 input 4 pin enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_09</name>
							<description>Enabled on pin P1_09.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP3_I3</name>
					<description>Analog comparator 3 input 3 pin enable.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_08</name>
							<description>Enabled on pin P1_08.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP3_I4</name>
					<description>Analog comparator 3 input 4 pin enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_07</name>
							<description>Enabled on pin P1_07.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2C0_SDA</name>
					<description>I2C0_SDA pin enable.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_23</name>
							<description>Enabled on pin P0_23.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2C0_SCL</name>
					<description>I2C0_SCL pin enable.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_22</name>
							<description>Enabled on pin P0_22.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT0_OUT3</name>
					<description>SCT0_OUT3 pin enable.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_00</name>
							<description>Enabled on pin P0_00.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT0_OUT4</name>
					<description>SCT0_OUT4 pin enable.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_01</name>
							<description>Enabled on pin P0_01.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT0_OUT5</name>
					<description>SCT0_OUT5 pin enable.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_18</name>
							<description>Enabled on pin P0_18.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT0_OUT6</name>
					<description>SCT0_OUT6 pin enable.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_24</name>
							<description>Enabled on pin P0_24.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT0_OUT7</name>
					<description>SCT0_OUT7 pin enable.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_14</name>
							<description>Enabled on pin P1_14.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT1_OUT3</name>
					<description>SCT1_OUT3 pin enable.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_02</name>
							<description>Enabled on pin P0_02.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT1_OUT4</name>
					<description>SCT1_OUT4 pin enable.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_03</name>
							<description>Enabled on pin P0_03.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT1_OUT5</name>
					<description>SCT1_OUT5 pin enable.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_14</name>
							<description>Enabled on pin P0_14.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT1_OUT6</name>
					<description>SCT1_OUT6 pin enable.</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_20</name>
							<description>Enabled on pin P0_20.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT1_OUT7</name>
					<description>SCT1_OUT7 pin enable.</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_17</name>
							<description>Enabled on pin P1_17.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT2_OUT3</name>
					<description>SCT2_OUT3 pin enable.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_06</name>
							<description>Enabled on pin P0_06.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT2_OUT4</name>
					<description>SCT2_OUT4 pin enable.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_29</name>
							<description>Enabled on pin P0_29.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT2_OUT5</name>
					<description>SCT2_OUT5 pin enable.</description>
					<bitRange>[17:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_20</name>
							<description>Enabled on pin P1_20.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT3_OUT3</name>
					<description>SCT3_OUT3 pin enable.</description>
					<bitRange>[18:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_26</name>
							<description>Enabled on pin P0_26.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT3_OUT4</name>
					<description>SCT3_OUT4 pin enable.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_08</name>
							<description>Enabled on pin P1_08.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT3_OUT5</name>
					<description>SCT3_OUT5 pin enable.</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P1_24</name>
							<description>Enabled on pin P1_24.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESETN</name>
					<description>RESETN pin enable.</description>
					<bitRange>[21:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_21</name>
							<description>Enabled on pin P0_21.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SWCLK_TCK</name>
					<description>SWCLK_TCK pin enable.</description>
					<bitRange>[22:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_19</name>
							<description>Enabled on pin P0_19.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SWDIO</name>
					<description>SWDIO pin enable.</description>
					<bitRange>[23:23]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED_ON_PIN_P0_20</name>
							<description>Enabled on pin P0_20.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
