cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
</registers>
		</peripheral>
		<peripheral derivedFrom="USART0">
			<name>USART1</name>
			<description>USART1</description>
			<baseAddress>0x40044000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1</name>
				<value>22</value>
			</interrupt>
		</peripheral>
		<peripheral>
	<name>SPI0</name>
	<description>SPI0  </description>
	<groupName>SPI0</groupName>
	<baseAddress>0x40048000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SPI0</name>
	<value>25</value>
	</interrupt>
	<registers>
		<register>
			<name>CFG</name>
			<description>SPI Configuration register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENABLE</name>
					<description>SPI enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The SPI is disabled and the internal state machine and counters are reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The SPI is enabled for operation.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MASTER</name>
					<description>Master mode select.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SLAVE_MODE</name>
							<description>Slave mode. The SPI will operate in slave mode. SCK, MOSI, and the SSEL signals are inputs, MISO is an output.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MASTER_MODE</name>
							<description>Master mode. The SPI will operate in master mode. SCK, MOSI, and the SSEL signals are outputs, MISO is an input.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LSBF</name>
					<description>LSB First mode enable.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD</name>
							<description>Standard. Data is transmitted and received in standard MSB first order.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REVERSE</name>
							<description>Reverse. Data is transmitted and received in reverse order (LSB first).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CPHA</name>
					<description>Clock Phase select.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CHANGE</name>
							<description>Change. The SPI captures serial data on the first clock transition of the frame (when the clock changes away from the rest state). Data is changed on the following edge.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CAPTURE</name>
							<description>Capture. The SPI changes serial data on the first clock transition of the frame (when the clock changes away from the rest state). Data is captured on the following edge.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CPOL</name>
					<description>Clock Polarity select.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>Low. The rest state of the clock (between frames) is low.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>High. The rest state of the clock (between frames) is high.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>LOOP</name>
					<description>Loopback mode enable. Loopback mode applies only to Master mode, and connects transmit and receive data connected together to allow simple software testing.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SPOL0</name>
					<description>SSEL0 Polarity select.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>Low. The SSEL0 pin is active low. The value in the SSEL0 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL0 is not inverted relative to the pins.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>High. The SSEL0 pin is active high. The value in the SSEL0 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL0 is inverted relative to the pins.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SPOL1</name>
					<description>SSEL1 Polarity select.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>Low. The SSEL1 pin is active low. The value in the SSEL1 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL1 is not inverted relative to the pins.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>High. The SSEL1 pin is active high. The value in the SSEL1 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL1 is inverted relative to the pins.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SPOL2</name>
					<description>SSEL2 Polarity select.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>Low. The SSEL2 pin is active low. The value in the SSEL2 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL2 is not inverted relative to the pins.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>High. The SSEL2 pin is active high. The value in the SSEL2 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL2 is inverted relative to the pins.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SPOL3</name>
					<description>SSEL3 Polarity select.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>Low. The SSEL3 pin is active low. The value in the SSEL3 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL3 is not inverted relative to the pins.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>High. The SSEL3 pin is active high. The value in the SSEL3 fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL3 is inverted relative to the pins.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DLY</name>
			<description>SPI Delay register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PRE_DELAY</name>
					<description>Controls the amount of time between SSEL assertion and the beginning of a data frame.  There is always one SPI clock time between SSEL assertion and the first clock edge. This is not considered part of the pre-delay. 0x0 = No additional time is inserted. 0x1 = 1 SPI clock time is inserted. 0x2 = 2 SPI clock times are inserted. ... 0xF = 15 SPI clock times are inserted.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>POST_DELAY</name>
					<description>Controls the amount of time between the end of a data frame and SSEL deassertion.  0x0 = No additional time is inserted. 0x1 = 1 SPI clock time is inserted. 0x2 = 2 SPI clock times are inserted. ... 0xF = 15 SPI clock times are inserted.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>FRAME_DELAY</name>
					<description>Controls the minimum amount of time between adjacent data frames.  0x0 = No additional time is inserted. 0x1 = 1 SPI clock time is inserted. 0x2 = 2 SPI clock times are inserted. ... 0xF = 15 SPI clock times are inserted.</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>TRANSFER_DELAY</name>
					<description>Controls the minimum amount of time that the SSEL is deasserted between transfers.  0x0 = The minimum time that SSEL is deasserted is 1 SPI clock time. (Zero added time.) 0x1 = The minimum time that SSEL is deasserted is 2 SPI clock times. 0x2 = The minimum time that SSEL is deasserted is 3 SPI clock times. ... 0xF = The minimum time that SSEL is deasserted is 16 SPI clock times.</description>
					<bitRange>[15:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STAT</name>
			<description>SPI Status. Some status flags can be cleared by writing a 1 to that bit position</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x0102</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXRDY</name>
					<description>Receiver Ready flag. When 1, indicates that data is available to be read from the receiver buffer. Cleared after a read of the RXDAT register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TXRDY</name>
					<description>Transmitter Ready flag. When 1, this bit indicates that data may be written to the transmit buffer. Previous data may still be in the process of being transmitted. Cleared when data is written to TXDAT or TXDATCTL until the data is moved to the transmit shift register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXOV</name>
					<description>Receiver Overrun interrupt flag. This flag applies only to slave mode (Master = 0). This flag is set when the beginning of a received character is detected while the receiver buffer is still in use. If this occurs, the receiver buffer contents are preserved, and the incoming data is lost. Data received by the SPI should be considered undefined if RxOv is set.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TXUR</name>
					<description>Transmitter Underrun interrupt flag. This flag applies only to slave mode (Master = 0). In this case, the transmitter must begin sending new data on the next input clock if the transmitter is idle. If that data is not available in the transmitter holding register at that point, there is no data to transmit and the TXUR flag is set. Data transmitted by the SPI should be considered undefined if TXUR is set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SSA</name>
					<description>Slave Select Assert. This flag is set whenever any slave select transitions from deasserted to asserted, in both master and slave modes. This allows determining when the SPI transmit/receive functions become busy, and allows waking up the device from reduced power modes when a slave mode access begins. This flag is cleared by software.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SSD</name>
					<description>Slave Select Deassert. This flag is set whenever any asserted slave selects transition to deasserted, in both master and slave modes. This allows determining when the SPI transmit/receive functions become idle. This flag is cleared by software.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>STALLED</name>
					<description>Stalled status flag. This indicates whether the SPI is currently in a stall condition.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ENDTRANSFER</name>
					<description>End Transfer control bit. Software can set this bit to force an end to the current transfer when the transmitter finishes any activity already in progress, as if the EOT flag had been set prior to the last transmission. This capability is included to support cases where it is not known when transmit data is written that it will be the end of a transfer. The bit is cleared when the transmitter becomes Idle as the transfer comes to an end. Forcing an end of transfer in this manner causes any specified FrameDelay and TransferDelay to be inserted.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>IDLE</name>
					<description>Idle status flag. This bit is 1 whenever the SPI master function is fully idle. This means that the transmit holding register is empty and the transmitter is not in the process of sending data.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTENSET</name>
			<description>SPI Interrupt Enable read and Set. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXRDYEN</name>
					<description>Determines whether an interrupt occurs when receiver data is available.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when receiver data is available.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when receiver data is available in the RXDAT register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXRDYEN</name>
					<description>Determines whether an interrupt occurs when the transmitter holding register is available.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when the transmitter holding register is available.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when data may be written to TXDAT.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXOVEN</name>
					<description>Determines whether an interrupt occurs when a receiver overrun occurs. This happens in slave mode when there is a need for the receiver to move newly received data to the RXDAT register when it is already in use. The interface prevents receiver overrun in Master mode by not allowing a new transmission to begin when a receiver overrun would otherwise occur.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when a receiver overrun occurs.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated if a receiver overrun occurs.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXUREN</name>
					<description>Determines whether an interrupt occurs when a transmitter underrun occurs. This happens in slave mode when there is a need to transmit data when none is available.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when the transmitter underruns.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated if the transmitter underruns.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SSAEN</name>
					<description>Determines whether an interrupt occurs when the Slave Select is asserted.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when any Slave Select transitions from deasserted to asserted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when any Slave Select transitions from deasserted to asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SSDEN</name>
					<description>Determines whether an interrupt occurs when the Slave Select is deasserted.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when all asserted Slave Selects transition to deasserted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when all asserted Slave Selects transition to deasserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTENCLR</name>
			<description>SPI Interrupt Enable Clear. Writing a 1 to any implemented bit position causes the corresponding bit in INTENSET to be cleared.</description>
			<addressOffset>0x010</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RXRDYEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TXRDYEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXOVEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TXUREN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SSAEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SSDEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
