cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
	<register>
		<name>MSTTIME</name>
		<description>Master timing configuration.</description>
		<addressOffset>0x24</addressOffset>
		<access>read-write</access>
		<resetValue>0x77</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MSTSCLLOW</name>
				<description>Master SCL Low time. Specifies the minimum low time that will be asserted by this master on SCL. Other devices on the bus (masters or slaves) could lengthen this time. This corresponds to the parameter tLOW in the I2C bus specification. I2C bus specification parameters tBUF and t SU;STA have the same values and are also controlled by MSTSCLLOW.</description>
				<bitRange>[2:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>2_CLOCKS</name>
						<description>2 clocks. Minimum SCL low time is 2 clocks of the I2C clock pre-divider.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>3_CLOCKS</name>
						<description>3 clocks. Minimum SCL low time is 3 clocks of the I2C clock pre-divider.</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_CLOCKS</name>
						<description>4 clocks. Minimum SCL low time is 4 clocks of the I2C clock pre-divider.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>5_CLOCKS</name>
						<description>5 clocks. Minimum SCL low time is 5 clocks of the I2C clock pre-divider.</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>6_CLOCKS</name>
						<description>6 clocks. Minimum SCL low time is 6 clocks of the I2C clock pre-divider.</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>7_CLOCKS</name>
						<description>7 clocks. Minimum SCL low time is 7 clocks of the I2C clock pre-divider.</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_CLOCKS</name>
						<description>8 clocks. Minimum SCL low time is 8 clocks of the I2C clock pre-divider.</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>9_CLOCKS</name>
						<description>9 clocks. Minimum SCL low time is 9 clocks of the I2C clock pre-divider.</description>
						<value>0x7</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>MSTSCLHIGH</name>
				<description>Master SCL High time. Specifies the minimum high time that will be asserted by this master on SCL. Other masters in a multi-master system could shorten this time. This corresponds to the parameter tHIGH in the I2C bus specification. I2C bus specification parameters tSU;STO and tHD;STA have the same values and are also controlled by MSTSCLHIGH.</description>
				<bitRange>[6:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>2_CLOCKS</name>
						<description>2 clocks. Minimum SCL high time is 2 clock of the I2C clock pre-divider.</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>3_CLOCKS</name>
						<description>3 clocks. Minimum SCL high time is 3 clocks of the I2C clock pre-divider .</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_CLOCKS</name>
						<description>4 clocks. Minimum SCL high time is 4 clock of the I2C clock pre-divider.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>5_CLOCKS</name>
						<description>5 clocks. Minimum SCL high time is 5 clock of the I2C clock pre-divider.</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>6_CLOCKS</name>
						<description>6 clocks. Minimum SCL high time is 6 clock of the I2C clock pre-divider.</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>7_CLOCKS</name>
						<description>7 clocks. Minimum SCL high time is 7 clock of the I2C clock pre-divider.</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_CLOCKS</name>
						<description>8 clocks. Minimum SCL high time is 8 clock of the I2C clock pre-divider.</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>9_CLOCKS</name>
						<description>9 clocks. Minimum SCL high time is 9 clocks of the I2C clock pre-divider.</description>
						<value>0x7</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:7]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MSTDAT</name>
		<description>Combined Master receiver and transmitter data register.</description>
		<addressOffset>0x28</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>DATA</name>
				<description>Master function data register. Read: read the most recently received data for the Master function. Write: transmit data using the Master function.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SLVCTL</name>
		<description>Slave control register.</description>
		<addressOffset>0x40</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SLVCONTINUE</name>
				<description>Slave Continue.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CONTINUE</name>
						<description>Continue. Informs the Slave function to continue to the next operation. This must done after writing transmit data, reading received data, or any other housekeeping related to the next bus operation.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SLVNACK</name>
				<description>Slave NACK.</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_EFFECT</name>
						<description>No effect.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NACK</name>
						<description>NACK. Causes the Slave function to NACK the master when the slave is receiving data from the master (Slave Receiver mode).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>SLVDMA</name>
				<description>Slave DMA enable.</description>
				<bitRange>[3:3]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>DISABLED</name>
						<description>Disabled. No DMA requests are issued for Slave mode operation.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. DMA requests are issued for I2C slave data transmission and reception.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:4]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SLVDAT</name>
		<description>Combined Slave receiver and transmitter data register.</description>
		<addressOffset>0x44</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>DATA</name>
				<description>Slave function data register. Read: read the most recently received data for the Slave function. Write: transmit data using the Slave function.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>4</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-3</dimIndex>
		<name>SLVADR%s</name>
		<description>Slave address 0.</description>
		<addressOffset>0x48</addressOffset>
		<access>read-write</access>
		<resetValue>0x01</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SADISABLE</name>
				<description>Slave Address n Disable.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ENABLED</name>
						<description>Enabled. Slave Address n is enabled and will be recognized with any changes specified by the SLVQUAL0 register.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>IGNORED_SLAVE_ADDRES</name>
						<description>Ignored Slave Address n is ignored.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SLVADR</name>
				<description>Seven bit slave address that is compared to received addresses if enabled.</description>
				<bitRange>[7:1]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SLVQUAL0</name>
		<description>Slave Qualification for address 0.</description>
		<addressOffset>0x58</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>QUALMODE0</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_SLVQUAL0_FIELD_I</name>
						<description>The SLVQUAL0 field is used as a logical mask for matching address 0.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_SLVQUAL0_FIELD_I</name>
						<description>The SLVQUAL0 field is used to extend address 0 matching in a range of addresses.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SLVQUAL0</name>
				<description>Slave address Qualifier for address 0. A value of 0 causes the address in SLVADR0 to be used as-is, assuming that it is enabled. If QUALMODE0 = 0, any bit in this field which is set to 1 will cause an automatic match of the corresponding bit of the received address when it is compared to the SLVADR0 register. If QUALMODE0 = 1, an address range is matched for address 0. This range extends from the value defined by SLVADR0 to the address defined by SLVQUAL0 (address matches when SLVADR0[7:1] &lt;
				= received address &lt;= SLVQUAL0[7:1]).</description>
				<bitRange>[7:1]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:8]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>MONRXDAT</name>
		<description>Monitor receiver data register.</description>
		<addressOffset>0x80</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MONRXDAT</name>
				<description>Monitor function Receiver Data. This reflects every data byte that passes on the I2C pins, and adds indication of Start, Repeated Start, and data NACK.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>MONSTART</name>
				<description>Monitor Received Start.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_DETECT</name>
						<description>No detect. The monitor function has not detected a Start event on the I2C bus.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_DETECT</name>
						<description>Start detect. The monitor function has detected a Start event on the I2C bus.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MONRESTART</name>
				<description>Monitor Received Repeated Start.</description>
				<bitRange>[9:9]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_START_DETECT</name>
						<description>No start detect. The monitor function has not detected a Repeated Start event on the I2C bus.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>REPEATED_START_DETEC</name>
						<description>Repeated start detect. The monitor function has detected a Repeated Start event on the I 2C bus.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MONNACK</name>
				<description>Monitor Received NACK.</description>
				<bitRange>[10:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>ACKNOWLEDGED</name>
						<description>Acknowledged. The data currently being provided by the monitor function was acknowledged by at least one master or slave receiver.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NOT_ACKNOWLEDGED</name>
						<description>Not acknowledged. The data currently being provided by the monitor function was not acknowledged by any receiver.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:11]</bitRange>
			</field>
		</fields>
	</register>
