cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>IE</name>
			<description>Interrupt enable clear register</description>
			<addressOffset>0xFE4</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INX_INT</name>
					<description>Indicates that an index pulse was detected.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TIM_INT</name>
					<description>Indicates that a velocity timer overflow occurred</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>VELC_INT</name>
					<description>Indicates that captured velocity is less than compare velocity.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DIR_INT</name>
					<description>Indicates that a change of direction was detected.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ERR_INT</name>
					<description>Indicates that an encoder phase error was detected.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENCLK_INT</name>
					<description>Indicates that and encoder clock pulse was detected.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>POS0_INT</name>
					<description>Indicates that the position 0 compare value is equal to the current position.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>POS1_INT</name>
					<description>Indicates that the position 1compare value is equal to the current position.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>POS2_INT</name>
					<description>Indicates that the position 2 compare value is equal to the current position.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>REV0_INT</name>
					<description>Indicates that the index compare value is equal to the current index count.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>POS0REV_INT</name>
					<description>Combined position 0 and revolution count interrupt. Set when both the POS0_INT bit is set and the REV0_INT is set.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>POS1REV_INT</name>
					<description>Combined position 1 and revolution count interrupt. Set when both the POS1_INT bit is set and the REV1_INT is set.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>POS2REV_INT</name>
					<description>Combined position 2 and revolution count interrupt. Set when both the POS2_INT bit is set and the REV2_INT is set.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>REV1_INT</name>
					<description>Indicates that the index 1 compare value is equal to the current index count.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>REV2_INT</name>
					<description>Indicates that the index 2 compare value is equal to the current index count.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>MAXPOS_INT</name>
					<description>Indicates that the current position count goes through the MAXPOS value to zero in forward direction, or through zero to MAXPOS in backward direction.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLR</name>
			<description>Interrupt status clear register</description>
			<addressOffset>0xFE8</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INX_INT</name>
					<description>Indicates that an index pulse was detected.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TIM_INT</name>
					<description>Indicates that a velocity timer overflow occurred</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>VELC_INT</name>
					<description>Indicates that captured velocity is less than compare velocity.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DIR_INT</name>
					<description>Indicates that a change of direction was detected.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ERR_INT</name>
					<description>Indicates that an encoder phase error was detected.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENCLK_INT</name>
					<description>Indicates that and encoder clock pulse was detected.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>POS0_INT</name>
					<description>Indicates that the position 0 compare value is equal to the current position.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>POS1_INT</name>
					<description>Indicates that the position 1compare value is equal to the current position.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>POS2_INT</name>
					<description>Indicates that the position 2 compare value is equal to the current position.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>REV0_INT</name>
					<description>Indicates that the index compare value is equal to the current index count.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>POS0REV_INT</name>
					<description>Combined position 0 and revolution count interrupt. Set when both the POS0_INT bit is set and the REV0_INT is set.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>POS1REV_INT</name>
					<description>Combined position 1 and revolution count interrupt. Set when both the POS1_INT bit is set and the REV1_INT is set.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>POS2REV_INT</name>
					<description>Combined position 2 and revolution count interrupt. Set when both the POS2_INT bit is set and the REV2_INT is set.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>REV1_INT</name>
					<description>Indicates that the index 1 compare value is equal to the current index count.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>REV2_INT</name>
					<description>Indicates that the index 2 compare value is equal to the current index count.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>MAXPOS_INT</name>
					<description>Indicates that the current position count goes through the MAXPOS value to zero in forward direction, or through zero to MAXPOS in backward direction.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SET</name>
			<description>Interrupt status set register</description>
			<addressOffset>0xFEC</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INX_INT</name>
					<description>Indicates that an index pulse was detected.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TIM_INT</name>
					<description>Indicates that a velocity timer overflow occurred</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>VELC_INT</name>
					<description>Indicates that captured velocity is less than compare velocity.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DIR_INT</name>
					<description>Indicates that a change of direction was detected.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ERR_INT</name>
					<description>Indicates that an encoder phase error was detected.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENCLK_INT</name>
					<description>Indicates that and encoder clock pulse was detected.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>POS0_INT</name>
					<description>Indicates that the position 0 compare value is equal to the current position.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>POS1_INT</name>
					<description>Indicates that the position 1compare value is equal to the current position.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>POS2_INT</name>
					<description>Indicates that the position 2 compare value is equal to the current position.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>REV0_INT</name>
					<description>Indicates that the index compare value is equal to the current index count.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>POS0REV_INT</name>
					<description>Combined position 0 and revolution count interrupt. Set when both the POS0_INT bit is set and the REV0_INT is set.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>POS1REV_INT</name>
					<description>Combined position 1 and revolution count interrupt. Set when both the POS1_INT bit is set and the REV1_INT is set.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>POS2REV_INT</name>
					<description>Combined position 2 and revolution count interrupt. Set when both the POS2_INT bit is set and the REV2_INT is set.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>REV1_INT</name>
					<description>Indicates that the index 1 compare value is equal to the current index count.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>REV2_INT</name>
					<description>Indicates that the index 2 compare value is equal to the current index count.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>MAXPOS_INT</name>
					<description>Indicates that the current position count goes through the MAXPOS value to zero in forward direction, or through zero to MAXPOS in backward direction.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
