cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
	</registers>
</peripheral>
		<peripheral>
	<name>SYSCON</name>
	<description> System configuration (SYSCON)</description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x40074000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0x1000</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>BOD_IRQ</name>
	<value>1</value>
	</interrupt>
	<registers>
		<register>
			<name>SYSMEMREMAP</name>
			<description>System memory remap</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x2</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAP</name>
					<description>tbd</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>RESERVED</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSTCKCAL</name>
			<description>System tick counter calibration</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAL</name>
					<description>System tick timer calibration value</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>NMISRC</name>
			<description>NMI Source Control</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IRQNO</name>
					<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 is 1. See Table 3 for the list of interrupt sources and their IRQ numbers.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[30:5]</bitRange>
				</field>
				<field>
					<name>NMIEN</name>
					<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSRSTSTAT</name>
			<description>System reset status register</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>POR</name>
					<description>POR reset status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_POR_DETECTED</name>
							<description>No POR detected</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POR_DETECTED_WRITIN</name>
							<description>POR detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EXTRST</name>
					<description>Status of the external RESET pin. External reset status.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_RESET_EVENT_DETEC</name>
							<description>No reset event detected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_DETECTED_WRIT</name>
							<description>Reset detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WDT</name>
					<description>Status of the Watchdog reset</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_WDT_RESET_DETECTE</name>
							<description>No WDT reset detected</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WDT_RESET_DETECTED_</name>
							<description>WDT reset detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BOD</name>
					<description>Status of the Brown-out detect reset</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_BOD_RESET_DETECTE</name>
							<description>No BOD reset detected</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOD_RESET_DETECTED_</name>
							<description>BOD reset detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYSRST</name>
					<description>Status of the software system reset</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_SYSTEM_RESET_DETE</name>
							<description>No System reset detected</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_RESET_DETECTE</name>
							<description>System reset detected. Writing a one clears this reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PRESETCTRL0</name>
			<description>Peripheral reset control 0</description>
			<addressOffset>0x044</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[6:0]</bitRange>
				</field>
				<field>
					<name>FLASH_RST</name>
					<description>Flash reset control</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_FLASH_RESET_</name>
							<description>Clear flash reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_FLASH_RESET_</name>
							<description>Assert flash reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FMC_RST</name>
					<description>FMC reset control FMC? Is this the flash controller?</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_FMC_RESET_</name>
							<description>Clear FMC reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_FMC_RESET_</name>
							<description>Assert FMC reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EEPROM_RST</name>
					<description>EEPROM reset control</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_EEPROM_RESET_</name>
							<description>Clear EEPROM reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_EEPROM_RESET_</name>
							<description>Assert EEPROM reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>PMUX_RST</name>
					<description>Pin mux reset control</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_PIN_MUX_RESET_</name>
							<description>Clear pin mux reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_PIN_MUX_RESET</name>
							<description>Assert pin mux reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>IOCON_RST</name>
					<description>IOCON reset control</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_IOCON_RESET_</name>
							<description>Clear IOCON reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_IOCON_RESET_</name>
							<description>Assert IOCON reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPIO0_RST</name>
					<description>GPIO0 reset control</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GPIO0_RESET_</name>
							<description>Clear GPIO0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GPIO0_RESET_</name>
							<description>Assert GPIO0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPIO1_RST</name>
					<description>GPIO1 reset control</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GPIO1_RESET_</name>
							<description>Clear GPIO1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GPIO1_RESET_</name>
							<description>Assert GPIO1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPIO2_RST</name>
					<description>GPIO2 reset control</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GPIO2_RESET_</name>
							<description>Clear GPIO2 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GPIO2_RESET_</name>
							<description>Assert GPIO2 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>PINT_RST</name>
					<description>Pin interrupt (PINT) reset control</description>
					<bitRange>[18:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_PINT_RESET_</name>
							<description>Clear PINT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_PINT_RESET_</name>
							<description>Assert PINT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GINT_RST</name>
					<description>Grouped interrupt (GINT) reset control</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GINT_RESET_</name>
							<description>Clear GINT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GINT_RESET_</name>
							<description>Assert GINT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMA_RST</name>
					<description>DMA reset control</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_DMA_RESET_</name>
							<description>Clear DMA reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_DMA_RESET_</name>
							<description>Assert DMA reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CRC_RST</name>
					<description>CRC generator reset control</description>
					<bitRange>[21:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_CRC_RESET_</name>
							<description>Clear CRC reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_CRC_RESET_</name>
							<description>Assert CRC reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[26:22]</bitRange>
				</field>
				<field>
					<name>ADC0_RST</name>
					<description>ADC0 reset control</description>
					<bitRange>[27:27]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_ADC0_RESET_</name>
							<description>Clear ADC0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_ADC0_RESET_</name>
							<description>Assert ADC0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADC1_RST</name>
					<description>ADC1 reset control</description>
					<bitRange>[28:28]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_ADC1_RESET_</name>
							<description>Clear ADC1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_ADC1_RESET_</name>
							<description>Assert ADC1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DAC_RST</name>
					<description>DAC reset control</description>
					<bitRange>[29:29]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_DAC_RESET_</name>
							<description>Clear DAC reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_DAC_RESET_</name>
							<description>Assert DAC reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP_RST</name>
					<description>Analog Comparator (ACMP) reset control for all four 4 comparators in the analog comparator block.</description>
					<bitRange>[30:30]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_CMP_RESET_</name>
							<description>Clear CMP reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_CMP_RESET_</name>
							<description>Assert CMP reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
