cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>PRESETCTRL1</name>
			<description>Peripheral reset control 1</description>
			<addressOffset>0x048</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MRT_RST</name>
					<description>Multi-rate timer (MRT) reset control</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_MRT_RESET_</name>
							<description>Clear MRT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_MRT_RESET_</name>
							<description>Assert MRT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RIT_RST</name>
					<description>Repetitive interrupt timer (RIT) reset control</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_RIT_RESET_</name>
							<description>Clear RIT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_RIT_RESET_</name>
							<description>Assert RIT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT0_RST</name>
					<description>State configurable timer 0 (SCT0) reset control</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT0_RESET_</name>
							<description>Clear SCT0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT0_RESET_</name>
							<description>Assert SCT0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT1_RST</name>
					<description>State configurable timer 1 (SCT1) reset control</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT1_RESET_</name>
							<description>Clear SCT1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT1_RESET_</name>
							<description>Assert SCT1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT2_RST</name>
					<description>State configurable timer 2 (SCT2) reset control</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT2_RESET_</name>
							<description>Clear SCT2 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT2_RESET_</name>
							<description>Assert SCT2 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT3_RST</name>
					<description>State configurable timer 3 (SCT3) reset control</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT3_RESET_</name>
							<description>Clear SCT3 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT3_RESET_</name>
							<description>Assert SCT3 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCTIPU_RST</name>
					<description>State configurable timer IPU (SCTIPU) reset control</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCTIPU_RESET_</name>
							<description>Clear SCTIPU reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCTIPU_RESET_</name>
							<description>Assert SCTIPU reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CCAN_RST</name>
					<description>CCAN reset control</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_CCAN_RESET_</name>
							<description>Clear CCAN reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_CCAN_RESET_</name>
							<description>Assert CCAN reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SPI0_RST</name>
					<description>SPI0 reset control</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SPI0_RESET_</name>
							<description>Clear SPI0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SPI0_RESET_</name>
							<description>Assert SPI0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SPI1_RST</name>
					<description>SPI1 reset control</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SPI1_RESET_</name>
							<description>Clear SPI1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SPI1_RESET_</name>
							<description>Assert SPI1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[12:11]</bitRange>
				</field>
				<field>
					<name>I2C0_RST</name>
					<description>I2C0 reset control</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_I2C0_RESET_</name>
							<description>Clear I2C0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_I2C0_RESET_</name>
							<description>Assert I2C0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[16:14]</bitRange>
				</field>
				<field>
					<name>UART0_RST</name>
					<description>UART0 reset control</description>
					<bitRange>[17:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_UART0_RESET_</name>
							<description>Clear UART0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_UART0_RESET_</name>
							<description>Assert UART0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>UART1_RST</name>
					<description>UART1 reset control</description>
					<bitRange>[18:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_UART1_RESET_</name>
							<description>Clear UART1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_UART1_RESET_</name>
							<description>Assert UART1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>UART2_RST</name>
					<description>UART2 reset control</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_UART2_RESET_</name>
							<description>Clear UART2 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_UART2_RESET_</name>
							<description>Assert UART2 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>QEI0_RST</name>
					<description>QEI0 reset control</description>
					<bitRange>[21:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_QEI0_RESET_</name>
							<description>Clear QEI0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_QEI0_RESET_</name>
							<description>Assert QEI0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>USB_RST</name>
					<description>USB reset control</description>
					<bitRange>[23:23]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_USB_RESET_</name>
							<description>Clear USB reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_USB_RESET_</name>
							<description>Assert USB reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIOPORCAP0</name>
			<description>POR captured PIO status 0</description>
			<addressOffset>0x04C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PIOSTAT</name>
					<description>State of PIO0_31 through PIO0_0 at power-on reset</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIOPORCAP1</name>
			<description>POR captured PIO status 1</description>
			<addressOffset>0x050</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PIOSTAT</name>
					<description>State of PIO1_31 through PIO1_0 at power-on reset</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIOPORCAP2</name>
			<description>POR captured PIO status 2</description>
			<addressOffset>0x054</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PIOSTAT</name>
					<description>State of PIO2_11 through PIO2_0 at power-on reset</description>
					<bitRange>[11:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAINCLKSELA</name>
			<description>Main clock source select A</description>
			<addressOffset>0x080</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>Clock source for main clock source selector A</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC Oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_OSCILLATOR</name>
							<description>System oscillator</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WATCHDOG_OSCILLATOR</name>
							<description>Watchdog oscillator</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAINCLKSELB</name>
			<description>Main clock source select B</description>
			<addressOffset>0x084</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>Clock source for main clock source selector B. Selects the clock source for the main clock.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MAINCLKSELA_CLOCK_S</name>
							<description>MAINCLKSELA. Clock source selected in MAINCLKSELA register.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_PLL_INPUT_</name>
							<description>System PLL input.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_PLL_OUTPUT_</name>
							<description>System PLL output.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RTC_OSCILLATOR_32_KH</name>
							<description>RTC oscillator 32 kHz output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKSEL</name>
			<description>USB clock source select</description>
			<addressOffset>0x088</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>USB clock source.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC Oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_OSCILLATOR</name>
							<description>System oscillator</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_PLL_OUT</name>
							<description>USB PLL out</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAIN_CLOCK</name>
							<description>Main clock</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ADCASYNCCLKSEL</name>
			<description>ADC asynchronous clock source select</description>
			<addressOffset>0x08C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>USB clock source.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC Oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_PLL_OUTPUT</name>
							<description>System PLL output</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_PLL_OUTPUT</name>
							<description>USB PLL output</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_PLL_OUTPUT</name>
							<description>SCT PLL output</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTSELA</name>
			<description>CLKOUT clock source select A</description>
			<addressOffset>0x094</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>CLKOUT clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CRYSTAL_OSCILLATOR_</name>
							<description>Crystal oscillator (SYSOSC)</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WATCHDOG_OSCILLATOR</name>
							<description>Watchdog oscillator</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAIN_CLOCK</name>
							<description>Main clock</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTSELB</name>
			<description>CLKOUT clock source select B</description>
			<addressOffset>0x098</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>CLKOUT clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLKOUTSELA_CLOCK_SO</name>
							<description>CLKOUTSELA. Clock source selected in the CLKOUTSELA register.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_PLL_OUTPUT_</name>
							<description>USB PLL output .</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_PLL_OUTPUT_</name>
							<description>SCT PLL output .</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RTC_32_KHZ_OUTPUT_</name>
							<description>RTC 32 kHz output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSPLLCLKSEL</name>
			<description>System PLL clock source select</description>
			<addressOffset>0x0A0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>System PLL clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC</name>
							<description>IRC</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CRYSTAL_OSCILLATOR_</name>
							<description>Crystal Oscillator (SYSOSC)</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBPLLCLKSEL</name>
			<description>USB PLL clock source select</description>
			<addressOffset>0x0A4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>USB PLL clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_THE_USB_PLL_CLO</name>
							<description>IRC. The USB PLL clock source must be switched to system oscillator for correct USB operation.In low-speed mode IRC is ok?</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_OSCILLATOR</name>
							<description>System oscillator</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SCTPLLCLKSEL</name>
			<description>SCT PLL clock source select</description>
			<addressOffset>0x0A8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>SCT PLL clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC</name>
							<description>IRC</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_OSCILLATOR</name>
							<description>System oscillator</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
