cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>SYSTICKCLKDIV</name>
			<description>SYSTICK clock divider</description>
			<addressOffset>0x0CC</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>SYSTICK clock divider values.  0: Disable SYSTICK timer clock.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>UARTCLKDIV</name>
			<description>USART clock divider. Clock divider for the USART fractional baud rate generator.</description>
			<addressOffset>0x0D0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>USART fractional baud rate generator clock divider values.  0: Clock disabled.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IOCONCLKDIV</name>
			<description>Peripheral clock to the IOCON block for programmable glitch filter</description>
			<addressOffset>0x0D4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TRACECLKDIV</name>
			<description>ARM trace clock divider</description>
			<addressOffset>0x0D8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>ARM trace clock divider values.  0: Disable TRACE_CLK.  1: Divide by 1.  to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKDIV</name>
			<description>USB clock divider</description>
			<addressOffset>0x0EC</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>USB clock divider values  0: Disable USB clock.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ADCASYNCCLKDIV</name>
			<description>Asynchronous ADC clock divider</description>
			<addressOffset>0x0F0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>USB clock divider values  0: Disable USB clock.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTDIV</name>
			<description>CLKOUT clock divider</description>
			<addressOffset>0x0F8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>CLKOUT clock divider values 0: Disable CLKOUT clock divider.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>FRGCTRL</name>
			<description>USART fractional baud rate generator control</description>
			<addressOffset>0x128</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>MULT</name>
					<description>Numerator of the fractional divider. MULT is equal to the programmed value.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKCTRL</name>
			<description>USB clock control</description>
			<addressOffset>0x12C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>AP_CLK</name>
					<description>USB need_clock signal control</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNDER_HARDWARE_CONTR</name>
							<description>Under hardware control.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FORCED_HIGH_</name>
							<description>Forced HIGH.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>POL_CLK</name>
					<description>USB need_clock polarity for triggering the USB wake-up interrupt</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FALLING_EDGE_OF_THE_</name>
							<description>Falling edge of the USB need_clock triggers the USB wake-up (default).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_OF_THE_U</name>
							<description>Rising edge of the USB need_clock triggers the USB wake-up.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKST</name>
			<description>USB clock status</description>
			<addressOffset>0x130</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>NEED_CLKST</name>
					<description>USB need_clock signal status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>LOW</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>HIGH</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>BODCTRL</name>
			<description>Brown-Out Detect</description>
			<addressOffset>0x180</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BODRSTLEV</name>
					<description>BOD reset level</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL_0_THE_RESET_A</name>
							<description>Level 0: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is .</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_1_THE_RESET_A</name>
							<description>Level 1: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is .</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_2_THE_RESET_A</name>
							<description>Level 2: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is .</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_3_THE_RESET_A</name>
							<description>Level 3: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODINTVAL</name>
					<description>BOD interrupt level</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL_0_THE_INTERRU</name>
							<description>Level 0: The interrupt assertion threshold voltage is ; the interrupt de-assertion threshold voltage is</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_1_THE_INTERRU</name>
							<description>Level 1: The interrupt assertion threshold voltage is  ; the interrupt de-assertion threshold voltage is .</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_2_THE_INTERRU</name>
							<description>Level 2: The interrupt assertion threshold voltage is ; the interrupt de-assertion threshold voltage is .</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_3_THE_INTERRU</name>
							<description>Level 3: The interrupt assertion threshold voltage is ; the interrupt de-assertion threshold voltage is .</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODRSTENA</name>
					<description>BOD reset enable</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_RESET_FUNCTI</name>
							<description>Disable reset function.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_RESET_FUNCTIO</name>
							<description>Enable reset function.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSOSCCTRL</name>
			<description>System oscillator control</description>
			<addressOffset>0x188</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BYPASS</name>
					<description>Bypass system oscillator</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_OSCILLATOR</name>
							<description>Disabled. Oscillator is not bypassed.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_PLL_INPUT_</name>
							<description>Enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin bypassing the oscillator. Use this mode when using an external clock source instead of the crystal oscillator.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FREQRANGE</name>
					<description>Determines frequency range for Low-power oscillator.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1__20_MHZ_FREQUENCY</name>
							<description>1 - 20 MHz frequency range.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>15__25_MHZ_FREQUENC</name>
							<description>15 - 25 MHz frequency range</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RTCOSCCTRL</name>
			<description>RTC oscillator control</description>
			<addressOffset>0x190</addressOffset>
			<access>read-write</access>
			<resetValue>0x1</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EN</name>
					<description>RTC 32 kHz clock enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_RTC_CLOCK_</name>
							<description>Disabled. RTC clock off.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_RTC_CLOCK_O</name>
							<description>Enabled. RTC clock on.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSPLLCTRL</name>
			<description>System PLL control</description>
			<addressOffset>0x198</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSEL</name>
					<description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 111111: Division ratio M = 64</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>PSEL</name>
					<description>Post divider ratio P. The division ratio is 2 x P.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>P_EQ_1</name>
							<description>P = 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_2</name>
							<description>P = 2</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_4</name>
							<description>P = 4</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_8</name>
							<description>P = 8</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write ones to reserved bits.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSPLLSTAT</name>
			<description>System PLL status</description>
			<addressOffset>0x19C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LOCK</name>
					<description>PLL lock status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>PLL_NOT_LOCKED</name>
							<description>PLL not locked</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PLL_LOCKED</name>
							<description>PLL locked</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBPLLCTRL</name>
			<description>USB PLL control</description>
			<addressOffset>0x1A0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>MSEL</name>
					<description>Feedback divider value. The division value M is the programmed MSEL value + 1.  00000: Division ratio M = 1 to 111111: Division ratio M = 64.</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>PSEL</name>
					<description>Post divider ratio P. The division ratio is 2 x P.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>P_EQ_1</name>
							<description>P = 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_2</name>
							<description>P = 2</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_4</name>
							<description>P = 4</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_8</name>
							<description>P = 8</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write ones to reserved bits.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBPLLSTAT</name>
			<description>USB PLL status</description>
			<addressOffset>0x1A4</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>LOCK</name>
					<description>PLL lock status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>PLL_NOT_LOCKED</name>
							<description>PLL not locked</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PLL_LOCKED</name>
							<description>PLL locked</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SCTPLLCTRL</name>
			<description>SCT PLL control</description>
			<addressOffset>0x1A8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>MSEL</name>
					<description>Feedback divider value. The division value M is the programmed MSEL value + 1.  00000: Division ratio M = 1 to 111111: Division ratio M = 64.</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>PSEL</name>
					<description>Post divider ratio P. The division ratio is 2 x P.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>P_EQ_1</name>
							<description>P = 1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_2</name>
							<description>P = 2</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_4</name>
							<description>P = 4</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P_EQ_8</name>
							<description>P = 8</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write ones to reserved bits.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SCTPLLSTAT</name>
			<description>SCT PLL status</description>
			<addressOffset>0x1AC</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>LOCK</name>
					<description>PLL lock status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>PLL_NOT_LOCKED</name>
							<description>PLL not locked</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PLL_LOCKED</name>
							<description>PLL locked</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
