cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<name>PMCFG</name>
			<description>Pattern match interrupt bit slice configuration register</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PROD_ENDPTS</name>
					<description>A 1 in any bit of this field causes the corresponding bit slice to be the final component of a product term in the boolean expression. This has two effects: 1. The interrupt request associated with this bit-slice will be asserted whenever a match to that product term is detected. 2. The next bit slice will start a new, independent product term in the boolean expression (i.e. an OR will be inserted in the boolean expression following the element controlled by this bit slice).</description>
					<bitRange>[6:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Bit slice 7 is automatically considered a product end point.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CFG0</name>
					<description>Specifies the match contribution condition for bit slice 0.</description>
					<bitRange>[10:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CFG1</name>
					<description>Specifies the match contribution condition for bit slice 1.</description>
					<bitRange>[13:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CFG2</name>
					<description>Specifies the match contribution condition for bit slice 2.</description>
					<bitRange>[16:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CFG3</name>
					<description>Specifies the match contribution condition for bit slice 3.</description>
					<bitRange>[19:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CFG4</name>
					<description>Specifies the match contribution condition for bit slice 4.</description>
					<bitRange>[22:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CFG5</name>
					<description>Specifies the match contribution condition for bit slice 5.</description>
					<bitRange>[25:23]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CFG6</name>
					<description>Specifies the match contribution condition for bit slice 6.</description>
					<bitRange>[28:26]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CFG7</name>
					<description>Specifies the match contribution condition for bit slice 7.</description>
					<bitRange>[31:29]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CONSTANT_HIGH_THIS_</name>
							<description>Constant HIGH. This bit slice always contributes to a product term match.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_EDGEMA</name>
							<description>Sticky rising edgeMatch occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_FALLING_EDGE_</name>
							<description>Sticky falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STICKY_RISING_OR_FAL</name>
							<description>Sticky rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared. This bit is only cleared when the PMCFG or the PMSRC registers are written to.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_LEVEL_MATCH_F</name>
							<description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_LEVEL_MATCH_OCC</name>
							<description>Low level. Match occurs when there is a low level on the specified input.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONSTANT_0_THIS_BIT</name>
							<description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices).</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_NON_STICKY_RI</name>
							<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3) . This bit is cleared after one clock cycle.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
