cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
	</registers>
</peripheral>
		<peripheral>
			<name>GINT0</name>
			<description>
				Group interrupt 0/1 (GINT0/1) </description>
			<groupName>GINT</groupName>
			<baseAddress>0x400A8000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GINT0</name>
				<value>5</value>
			</interrupt>
		<registers>
	<register>
		<name>CTRL</name>
		<description>GPIO grouped interrupt control register</description>
		<addressOffset>0x000</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>INT</name>
				<description>Group interrupt status. This bit is cleared by writing a one to it. Writing zero has no effect.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_INTERRUPT_REQUEST</name>
						<description>No interrupt request is pending.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INTERRUPT_REQUEST_IS</name>
						<description>Interrupt request is active.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>COMB</name>
				<description>Combine enabled inputs for group interrupt</description>
				<bitRange>[1:1]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>OR_FUNCTIONALITY_A_</name>
						<description>OR functionality: A grouped interrupt is generated when any one of the enabled inputs is active (based on its programmed polarity).</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>AND_FUNCTIONALITY_A</name>
						<description>AND functionality: An interrupt is generated when all enabled bits are active (based on their programmed polarity).</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>TRIG</name>
				<description>Group interrupt trigger</description>
				<bitRange>[2:2]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>EDGE_TRIGGERED</name>
						<description>Edge-triggered</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>LEVEL_TRIGGERED</name>
						<description>Level-triggered</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved</description>
				<bitRange>[31:3]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>3</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-2</dimIndex>
		<name>PORT_POL[%s]</name>
		<displayName>PORT_POL[%s]</displayName>
		<description>GPIO grouped interrupt port 0 polarity register</description>
		<addressOffset>0x020</addressOffset>
		<access>read-write</access>
		<resetValue>0xFFFFFFFF</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>POL0</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[0:0]</bitRange>
			</field>
			<field>
				<name>POL1</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[1:1]</bitRange>
			</field>
			<field>
				<name>POL2</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[2:2]</bitRange>
			</field>
			<field>
				<name>POL3</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>POL4</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[4:4]</bitRange>
			</field>
			<field>
				<name>POL5</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[5:5]</bitRange>
			</field>
			<field>
				<name>POL6</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[6:6]</bitRange>
			</field>
			<field>
				<name>POL7</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[7:7]</bitRange>
			</field>
			<field>
				<name>POL8</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>POL9</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[9:9]</bitRange>
			</field>
			<field>
				<name>POL10</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[10:10]</bitRange>
			</field>
			<field>
				<name>POL11</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[11:11]</bitRange>
			</field>
			<field>
				<name>POL12</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[12:12]</bitRange>
			</field>
			<field>
				<name>POL13</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[13:13]</bitRange>
			</field>
			<field>
				<name>POL14</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[14:14]</bitRange>
			</field>
			<field>
				<name>POL15</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[15:15]</bitRange>
			</field>
			<field>
				<name>POL16</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>POL17</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[17:17]</bitRange>
			</field>
			<field>
				<name>POL18</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[18:18]</bitRange>
			</field>
			<field>
				<name>POL19</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[19:19]</bitRange>
			</field>
			<field>
				<name>POL20</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[20:20]</bitRange>
			</field>
			<field>
				<name>POL21</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[21:21]</bitRange>
			</field>
			<field>
				<name>POL22</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[22:22]</bitRange>
			</field>
			<field>
				<name>POL23</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[23:23]</bitRange>
			</field>
			<field>
				<name>POL24</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[24:24]</bitRange>
			</field>
			<field>
				<name>POL25</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[25:25]</bitRange>
			</field>
			<field>
				<name>POL26</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[26:26]</bitRange>
			</field>
			<field>
				<name>POL27</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[27:27]</bitRange>
			</field>
			<field>
				<name>POL28</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[28:28]</bitRange>
			</field>
			<field>
				<name>POL29</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[29:29]</bitRange>
			</field>
			<field>
				<name>POL30</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>POL31</name>
				<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
