cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_CMDREQ</name>
			<description>Message interface  command request</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0x0001</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MN</name>
					<description>Message number 0x01 - 0x20 = Valid message numbers. The message object in the message RAM is selected for data transfer. 0x00 = Not a valid message number. This value is interpreted as 0x20.[1] 0x21 - 0x3F = Not a valid message number. This value is interpreted as 0x01 - 0x1F.[1]</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[14:6]</bitRange>
				</field>
				<field>
					<name>BUSY</name>
					<description>BUSY flag</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DONE</name>
							<description>Done. Set to zero by hardware when read/write action to this Command request register has finished.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BUSY</name>
							<description>Busy. Set to one by hardware when writing to this Command request register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_CMDMSK_W</name>
			<description>Message interface  command mask (write direction)</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA_B</name>
					<description>Access data bytes 4-7</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Data bytes 4-7 unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer data bytes 4-7 to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DATA_A</name>
					<description>Access data bytes 0-3</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Data bytes 0-3 unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer data bytes 0-3 to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXRQST</name>
					<description>Access transmission request bit</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_TRANSMISSION_REQU</name>
							<description>No transmission request. TXRQSRT bit unchanged in IF1/2_MCTRL. If a transmission is requested by programming this bit, the TXRQST bit in the CANIFn_MCTRL register is ignored.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REQUEST_A_TRANSMISSI</name>
							<description>Request a transmission. Set the TXRQST bit IF1/2_MCTRL.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLRINTPND</name>
					<description>This bit is ignored in the write direction.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CTRL</name>
					<description>Access control bits</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Control bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer control bits to message object</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ARB</name>
					<description>Access arbitration bits</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Arbitration bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer Identifier, DIR, XTD, and MSGVAL bits to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MASK</name>
					<description>Access mask bits</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Mask bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer Identifier MASK + MDIR + MXTD to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WR_RD</name>
					<description>Write transfer Transfer data from the selected message buffer registers to the message object addressed by the command request register CANIFn_CMDREQ.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_CMDMSK_R</name>
			<description>Message interface  command mask (read direction)</description>
			<alternateRegister>IF%s_CMDMSK_W</alternateRegister>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA_B</name>
					<description>Access data bytes 4-7</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Data bytes 4-7 unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer data bytes 4-7 to IFx message buffer register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DATA_A</name>
					<description>Access data bytes 0-3</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Data bytes 0-3 unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer data bytes 0-3 to IFx message buffer.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NEWDAT</name>
					<description>Access new data bit</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. NEWDAT bit remains unchanged. A read access to a message object can be combined with the reset of the control bits INTPND and NEWDAT in IF1/2_MCTRL. The values of these bits transferred to the IFx Message Control Register always reflect the status before resetting these bits.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR</name>
							<description>Clear. Clear NEWDAT bit in the message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLRINTPND</name>
					<description>Clear interrupt pending bit.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. INTPND bit remains unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR</name>
							<description>Clear. Clear INTPND bit in the message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CTRL</name>
					<description>Access control bits</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Control bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer control bits to IFx message buffer.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ARB</name>
					<description>Access arbitration bits</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Arbitration bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer Identifier, DIR, XTD, and MSGVAL bits to IFx message buffer register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MASK</name>
					<description>Access mask bits</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Unchanged. Mask bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER</name>
							<description>Transfer. Transfer Identifier MASK + MDIR + MXTD to IFx message buffer register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WR_RD</name>
					<description>Read transfer Transfer data from the message object addressed by the command request register to the selected message buffer registers CANIFn_CMDREQ.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_MSK1</name>
			<description>Message interface  mask 1</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSK15_0</name>
					<description>Identifier mask [15:0]</description>
					<bitRange>[15:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MATCH</name>
							<description>Match. The corresponding bit in the identifier of the message cannot inhibit the match in the acceptance filtering.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MASK</name>
							<description>Mask. The corresponding identifier bit is used for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_MSK2</name>
			<description>Message interface  mask 2</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSK28_16</name>
					<description>Identifier mask [28:16]</description>
					<bitRange>[12:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MATCH</name>
							<description>Match. The corresponding bit in the identifier of the message cannot inhibit the match in the acceptance filtering.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MASK</name>
							<description>Mask. The corresponding identifier bit is used for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>MDIR</name>
					<description>Mask message direction</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>WITHOUT_DIR_BIT</name>
							<description>Without DIR bit. The message direction bit (DIR) has no effect on acceptance filtering.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WITH_DIR_BIT</name>
							<description>With DIR bit. The message direction bit (DIR) is used for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MXTD</name>
					<description>Mask extend identifier</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>WITHOUT_XTD</name>
							<description>Without XTD. The extended identifier bit (XTD) has no effect on acceptance filtering.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WITH_XTD</name>
							<description>With XTD. The extended identifier bit (XTD) is used for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_ARB1</name>
			<description>Message interface  arbitration 1</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ID15_0</name>
					<description>Message identifier [15:0] 29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_ARB2</name>
			<description>Message interface  arbitration 2</description>
			<addressOffset>0x034</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ID28_16</name>
					<description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
					<bitRange>[12:0]</bitRange>
				</field>
				<field>
					<name>DIR</name>
					<description>Message direction</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RECEIVE</name>
							<description>Receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TANSMIT</name>
							<description>Tansmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>XTD</name>
					<description>Extend identifier</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD</name>
							<description>Standard. The 11-bit standard identifier will be used for this message object.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EXTENDED</name>
							<description>Extended. The 29-bit extended identifier will be used for this message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSGVAL</name>
					<description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INVALID</name>
							<description>Invalid. The message object is ignored by the message handler.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VALID</name>
							<description>Valid. The message object is configured and should be considered by the message handler.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
