cmsis-svd/cmsis-svd/data/NXP/LPC15xx.svd
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_MCTRL</name>
			<description>Message interface  message control</description>
			<addressOffset>0x038</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DLC3_0</name>
					<description>Data length code 3:0 The Data Length Code of a Message Object must be defined the same as in all the corresponding objects with the same identifier at other nodes. When the Message Handler stores a data frame, it will write the DLC to the value given by the received message. 0000 - 1000 = Data frame has 0 - 8 data bytes. 1001 - 1111 = Data frame has 8 data bytes.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[6:4]</bitRange>
				</field>
				<field>
					<name>EOB</name>
					<description>End of buffer</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_END_OF_BUFFER</name>
							<description>Not end of buffer. Message object belongs to a FIFO buffer and is not the last message object of that FIFO buffer.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>END_OF_BUFFER</name>
							<description>End of buffer. Single message object or last message object of a FIFO buffer.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXRQST</name>
					<description>Transmit request</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_WAITING</name>
							<description>Not waiting. This message object is not waiting for transmission.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WAITING</name>
							<description>Waiting. The transmission of this message object is requested and is not yet done</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RMTEN</name>
					<description>Remote enable</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TXRQST_UNCHANGED</name>
							<description>TXRQST unchanged. At the reception of a remote frame, TXRQST is left unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TXRQST_SET</name>
							<description>TXRQST set. At the reception of a remote frame, TXRQST is set.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXIE</name>
					<description>Receive interrupt enable</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INTPND_UNCHANGED</name>
							<description>INTPND unchanged. INTPND will be left unchanged after successful reception of a frame.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTPND_SET</name>
							<description>INTPND set. INTPND will be set after successful reception of a frame.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXIE</name>
					<description>Transmit interrupt enable</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INTPND_UNCHANGED</name>
							<description>INTPND unchanged. The INTPND bit will be left unchanged after a successful transmission of a frame.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTPND_SET</name>
							<description>INTPND set. INTPND will be set after a successful transmission of a frame.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>UMASK</name>
					<description>Use acceptance mask If UMASK is set to 1, the message object's mask bits have to be programmed during initialization of the message object before MAGVAL is set to 1.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IGNORE</name>
							<description>Ignore. Mask ignored.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USE</name>
							<description>Use. Use mask (MSK[28:0], MXTD, and MDIR) for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTPND</name>
					<description>Interrupt pending</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_PENDING</name>
							<description>Not pending. This message object is not the source of an interrupt.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING</name>
							<description>Pending. This message object is the source of an interrupt. The Interrupt Identifier in the Interrupt Register will point to this message object if there is no other interrupt source with higher priority.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSGLST</name>
					<description>Message lost (only valid for message objects in the direction receive).</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_LOST</name>
							<description>Not lost. No message lost since this bit was reset last by the CPU.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOST</name>
							<description>Lost. The Message Handler stored a new message into this object when NEWDAT was still set, the CPU has lost a message.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NEWDAT</name>
					<description>New data</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_NEW_DATA</name>
							<description>No new data. No new data has been written into the data portion of this message object by the message handler since this flag was cleared last by the CPU.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NEW_DATA</name>
							<description>New data. The message handler or the CPU has written new data into the data portion of this message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_DA1</name>
			<description>Message interface  data A1</description>
			<addressOffset>0x03C</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA0</name>
					<description>Data byte 0</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA1</name>
					<description>Data byte 1</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_DA2</name>
			<description>Message interface 1 data A2</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA2</name>
					<description>Data byte 2</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA3</name>
					<description>Data byte 3</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_DB1</name>
			<description>Message interface 1 data B1</description>
			<addressOffset>0x044</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA4</name>
					<description>Data byte 4</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA5</name>
					<description>Data byte 5</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>IF%s_DB2</name>
			<description>Message interface 1 data B2</description>
			<addressOffset>0x048</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA6</name>
					<description>Data byte 6</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA7</name>
					<description>Data byte 7</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXREQ1</name>
			<description>Transmission request 1</description>
			<addressOffset>0x100</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TXRQST16_1</name>
					<description>Transmission request bit of message objects 16 to 1. 0 = This message object is not waiting for transmission. 1 = The transmission of this message object is requested and not yet done.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXREQ2</name>
			<description>Transmission request 2</description>
			<addressOffset>0x104</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TXRQST32_17</name>
					<description>Transmission request bit of message objects 32 to 17. 0 = This message object is not waiting for transmission. 1 = The transmission of this message object is requested and not yet done.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ND1</name>
			<description>New data 1</description>
			<addressOffset>0x120</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NEWDAT16_1</name>
					<description>New data bits of message objects 16 to 1. 0 = No new data has been written into the data portion of this Message Object by the Message Handler since last time this flag was cleared by the CPU. 1 = The Message Handler or the CPU has written new data into the data portion of this Message Object.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ND2</name>
			<description>New data 2</description>
			<addressOffset>0x124</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NEWDAT32_17</name>
					<description>New data bits of message objects 32 to 17. 0 = No new data has been written into the data portion of this Message Object by the Message Handler since last time this flag was cleared by the CPU. 1 = The Message Handler or the CPU has written new data into the data portion of this Message Object.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IR1</name>
			<description>Interrupt pending 1</description>
			<addressOffset>0x140</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTPND16_1</name>
					<description>Interrupt pending bits of message objects 16 to 1. 0 = This message object is ignored by the message handler. 1 = This message object is the source of an interrupt.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IR2</name>
			<description>Interrupt pending 2</description>
			<addressOffset>0x144</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTPND32_17</name>
					<description>Interrupt pending bits of message objects 32 to 17. 0 = This message object is ignored by the message handler. 1 = This message object is the source of an interrupt.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MSGV1</name>
			<description>Message valid 1</description>
			<addressOffset>0x160</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSGVAL16_1</name>
					<description>Message valid bits of message objects 16 to 1. 0 = This message object is ignored by the message handler. 1 = This message object is configured and should be considered by the message handler.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MSGV2</name>
			<description>Message valid 2</description>
			<addressOffset>0x164</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSGVAL32_17</name>
					<description>Message valid bits of message objects 32 to 17. 0 = This message object is ignored by the message handler. 1 = This message object is configured and should be considered by the message handler.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKDIV</name>
			<description>CAN clock divider register</description>
			<addressOffset>0x180</addressOffset>
			<access>read-write</access>
			<resetValue>0x1</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKDIVVAL</name>
					<description>Clock divider value. CAN_CLK =  system clock/(CLKDIVVAL +1) 0000: CAN_CLK = system clock divided by 1. 0001: CAN_CLK = system clock divided by 2. 0010: CAN_CLK = system clockdivided by 3 0011: CAN_CLK = system clock divided by 4. ... 1111: CAN_CLK = system clock divided by 16.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
